H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
/* ============================================================================
   ESP32 Scrabble — Pancake (ESP32-C5, ST7796 320x480, FT6336 capacitive touch)
   ============================================================================
   German + English Scrabble. Standalone touch firmware sharing the H4W9 UI shell
   (header with back button + status corner, footer nav bar, momentum list menus,
   chip settings rows) with the ESP32_FlipSocial firmware, and sharing its SD
   dictionaries with the ESP32 Library reader.

   M1 (this file so far): shell, settings, WiFi, and a Dictionary screen that
   loads a .dwg word list into PSRAM and answers word lookups. Board, rules and
   the CPU opponent come at M2/M3 — see PLAN.md.

   Arduino IDE settings:
     Board            : ESP32C5 Dev Module
     Flash Size       : 8MB
     Partition Scheme : Custom  ->  partitions.csv in this folder
     Flash Frequency  : 80 MHz
     PSRAM            : Enabled     <-- required, the word lists live there

   Requires the patched TFT_eSPI-ESP32-C5 library with User_Setup_Select.h set to
   #include <User_Setup_marauder_pancake.h>.
   ============================================================================ */

#include "configs.h"

#include <Arduino.h>
#include <SPI.h>
#include <SD.h>
#include <SPIFFS.h>
#include <Wire.h>
#include <WiFi.h>
#include <ArduinoJson.h>

#include "ft6336.h"
#include "TouchKeyboard.h"
#include "theme.h"
#include "board_theme.h"
#include "vlw.h"
#include "dawg.h"
#include "game.h"
#include "letters.h"
#include "cpu.h"
#include "define.h"
#include "boardgrid.h"
#include "wordedit.h"

// Picoware core (panel init, touch, HTTP).
#include "src/Picoware/internal/boards.hpp"
#include "src/Picoware/internal/gui/draw.hpp"
#include "src/Picoware/internal/system/input.hpp"
#include "src/Picoware/internal/system/http.hpp"
#include "src/Picoware/internal/system/view.hpp"
#include "src/Picoware/internal/system/view_manager.hpp"
using namespace Picoware;

// Globals
#ifdef HAS_C5_SD
SPIClass sharedSPI(SPI);
#endif

static ViewManager *vm    = nullptr;   // owns Draw (panel) + InputManager (touch)
static TFT_eSPI    *tft   = nullptr;   // raw panel (from Draw) for the shell screens
static TouchInput  *touch = nullptr;   // FT6336 touch source (from InputManager)
static Theme        theme;             // colour theme + accent + font + brightness

// Theme-driven colours (macros so every use follows the current theme).
#define COL_BG     (theme.bg())
#define COL_FG     (theme.fg())
#define COL_ACCENT (theme.hdr())
#define COL_DIM    (theme.dim())
#define COL_SEL    (theme.sel())
static const uint16_t COL_OK = 0x07E0;   // status green (theme-independent)

// Panel size comes from the board block in configs.h. Rotation is left at the
// power-on default (0 = portrait), which suits the menus. The board view will
// switch to landscape at M2, where a 15x15 grid needs the wider axis.
static const int SCRW = TFT_WIDTH;
static const int SCRH = TFT_HEIGHT;

// Shell layout — matches H4W9 (header 28, nav 28, list rows 34).
static const int HDRH     = 28;
static const int NAVH     = 28;
// The settings list is drawn at fixed offsets and does not scroll, so the rows
// have to fit the panel: at 34 px they run off the bottom of the V8's 320 px
// screen. 26 px still clears the 22 px chips and the 16 px font.
#ifdef MARAUDER_V8
static const int ITEMH    = 26;
#else
static const int ITEMH    = 34;
#endif
static const int CONTENTY = HDRH;

// Game language. Picks which .dwg is loaded and, later, which tile distribution
// is used — the two must always agree, so they share this one setting.
enum Lang : uint8_t { LANG_DE = 0, LANG_EN = 1 };
static const char *const LANG_NAMES[2] = { "Deutsch", "English" };
static const char *const LANG_FILES[2] = { SCRABBLE_DIR "/de.dwg", SCRABBLE_DIR "/en.dwg" };
// Reduced "everyday vocabulary" lists. The CPU plays from one of these when the
// human-like setting is on, so it can't win with words nobody knows. Word
// validation always uses the FULL list, so the human is never restricted.
static const char *const LANG_COMMON[2] = { SCRABBLE_DIR "/de_common.dwg",
                                            SCRABBLE_DIR "/en_common.dwg" };

// Kept below the type declarations above: Arduino inserts its auto-generated
// prototypes ahead of the FIRST function in the sketch, so defining any function
// above these types would push the prototypes above them and break the build.
static Dawg    g_dawg;                 // full word list, used for validation (PSRAM)
static Dawg    g_dawgCpu;              // reduced list the CPU plays from (PSRAM)
static uint8_t g_lang = LANG_DE;       // persisted in /scrab_cfg.json
static bool    g_cpuCommon = true;     // "human-like vocabulary" for the CPU
static bool    g_luckHelper = true;    // balanced bag + steered draws (Game::refill)
static uint8_t g_crossLimit = MAX_CROSS_WORDS;   // parallel words a play may form

// The word list the move generator should search. Falls back to the full list
// if the reduced one is switched off or missing from the SD card.
static const Dawg &cpuDict() {
  return (g_cpuCommon && g_dawgCpu.loaded()) ? g_dawgCpu : g_dawg;
}

#ifndef HAS_CAP_TOUCH
// Resistive touch calibration (V8). Capacitive panels report real coordinates
// and need none of this. The 5 uint16 blob is TFT_eSPI's own format; it lives on
// SPIFFS next to the other settings.
static const char *TOUCH_CAL_FILE = "/scrab_touch.dat";

static bool touchCalLoad(uint16_t *cal) {
  File f = SPIFFS.open(TOUCH_CAL_FILE, "r");
  if (!f) return false;
  bool ok = (f.read((uint8_t *)cal, sizeof(uint16_t) * 5) == sizeof(uint16_t) * 5);
  f.close();
  return ok;
}
static void touchCalSave(const uint16_t *cal) {
  File f = SPIFFS.open(TOUCH_CAL_FILE, "w");
  if (!f) return;
  f.write((const uint8_t *)cal, sizeof(uint16_t) * 5);
  f.close();
}
// TFT_eSPI's 4-corner wizard. Blocking, and deliberately drawn without the theme
// so it is legible before anything else is up.
static void touchCalRun() {
  uint16_t cal[5];
  tft->fillScreen(TFT_BLACK);
  tft->setTextColor(TFT_WHITE, TFT_BLACK);
  tft->setTextDatum(MC_DATUM);
  tft->drawString("Touch Calibration", SCRW / 2, SCRH / 2 - 24, 4);
  tft->drawString("Tap each corner arrow", SCRW / 2, SCRH / 2 + 6, 2);
  tft->setTextDatum(TL_DATUM);
  delay(1500);
  tft->fillScreen(TFT_BLACK);
  tft->calibrateTouch(cal, TFT_MAGENTA, TFT_BLACK, 15);
  tft->setTouch(cal);
  touchCalSave(cal);
}
static void touchCalInit() {
  uint16_t cal[5];
  if (touchCalLoad(cal)) tft->setTouch(cal);
  else                   touchCalRun();
}
#endif // !HAS_CAP_TOUCH

// Touch helpers
// Wait for a fresh tap (press edge) and return its point; blocks.
static bool waitTap(uint16_t &x, uint16_t &y, uint32_t timeoutMs = 0) {
  uint32_t start = millis();
  bool wasDown = touch->isPressed();
  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    if (down && !wasDown) { x = touch->x(); y = touch->y(); return true; }
    wasDown = down;
    if (timeoutMs && (millis() - start) > timeoutMs) return false;
    delay(8);
    yield();
  }
}

