H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
static bool inRect(uint16_t x, uint16_t y, int rx, int ry, int rw, int rh) {
  return (int)x >= rx && (int)x < rx + rw && (int)y >= ry && (int)y < ry + rh;
}

// NOTE: the whole UI is portrait, so nothing rotates the panel. If a landscape
// view is ever added, rotate the panel AND the touch mapping together —
// TouchInput caches both the rotation it maps with and the bounds it clamps to
// (see TouchInput::setRotation), and rotating only the display leaves every tap
// mis-mapped and clamped to the portrait width. That bug made an earlier
// landscape board look frozen.

// Theme / brightness plumbing
static void applyBrightness() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(TFT_BL, theme.duty());
#else
  ledcWrite(0, theme.duty());
#endif
}
static void applyThemeToViewManager() {
  if (!vm) return;
  vm->setBackgroundColor(theme.bg());
  vm->setForegroundColor(theme.fg());
  vm->setSelectedColor(theme.sel());
}

// Smooth-font drawing
// Every string in the UI goes through these. They keep the old TFT_eSPI font
// numbers (1/2/4) at the call sites but render with the VLW smooth fonts, which
// is what gives us real Ä Ö Ü ß glyphs — see vlw.h.
//
// Note TFT_eSPI ignores the font-number argument to drawString once a smooth
// font is loaded, so the correct VLW array MUST be loaded first; that is what
// these wrappers are for.
static void drawStr(const String &s, int32_t x, int32_t y, uint8_t fontNum) {
  vlwLoad(*tft, fontNum, g_vlw_cur_tft);
  char buf[160];
  vlwPrivToUtf8(s.c_str(), buf, sizeof(buf));
  tft->drawString(buf, x, y);
}
static int16_t strWidth(const String &s, uint8_t fontNum) {
  return vlwTextWidth(vlwData(fontNum), s.c_str());
}
// Variant taking an explicit sprite + font tracker: each sprite object carries
// its own loaded font, so it needs its own "currently loaded" tracker rather
// than sharing the panel's.
//
// NOTE this is deliberately NOT a template. Arduino generates function
// prototypes from the .ino with ctags and inserts them above everything else;
// for a template it emits the signature WITHOUT the `template<>` line, so the
// type parameter is undeclared and the sketch fails to compile. Templates in
// this project must live in a header (see vlwLoad in vlw.h).
static void sprStr(TFT_eSprite &g, const uint8_t *&track,
                   const String &s, int32_t x, int32_t y, uint8_t fontNum) {
  vlwLoad(g, fontNum, track);
  char buf[160];
  vlwPrivToUtf8(s.c_str(), buf, sizeof(buf));
  g.drawString(buf, x, y);
}

// Status LED. Colour-coded by action where the hardware allows:
//   amber = WiFi scan/connect, blue = SD/dictionary load, green = success, red = error.
#ifdef HAS_ACT_LED
// V8: one blue GPIO LED (active-high). GPIO28 is a strapping pin (pull-up =
// normal SPI boot), so it is a plain digital output — no PWM/LEDC on the strap
// pin and no pad-hold, so a reset always releases it and boots normally.
static bool g_actLedReady = false;
static void ledActArm() {
  if (g_actLedReady) return;
  pinMode(ACT_LED_PIN, OUTPUT);
  digitalWrite(ACT_LED_PIN, LOW);
  g_actLedReady = true;
}
static void ledActSet(bool on) {
  ledActArm();
  digitalWrite(ACT_LED_PIN, (on && theme.led_bright > 0) ? HIGH : LOW);
}
static inline void ledOff()  { ledActSet(false); }
static inline void ledWifi() { ledActSet(true); }
static inline void ledBusy() { ledActSet(true); }
static inline void ledOk()   { ledActSet(true); }
static inline void ledErr()  { ledActSet(true); }
static inline void ledBlinkOk(uint16_t ms = 150) { ledActSet(true); delay(ms); ledActSet(false); }
static void ledSet(bool on) { ledActSet(on); }

#else
// Pancake: onboard addressable RGB LED (WS2812-style).
#ifdef RGB_BUILTIN
  #define PW_RGB_PIN RGB_BUILTIN
#else
  #define PW_RGB_PIN LED_BUILTIN
#endif
// The RGB LED is WS2812-style: consecutive frames must be separated by a reset
// gap (>50us idle low) or the LED latches the first frame and passes the next
// one down the chain — so a colour followed immediately by off stays lit.
static inline void ledGap() { delayMicroseconds(300); }
static void ledRGB(uint8_t r, uint8_t g, uint8_t b) {
  uint16_t s = theme.led_bright;
  ledGap();
  rgbLedWrite(PW_RGB_PIN, (uint8_t)((uint16_t)r * s / 20),
                          (uint8_t)((uint16_t)g * s / 20),
                          (uint8_t)((uint16_t)b * s / 20));
}
static inline void ledOff()  { ledGap(); rgbLedWrite(PW_RGB_PIN, 0, 0, 0); }  // truly off
static inline void ledWifi() { ledRGB(255, 150, 0); }  // amber — scanning / connecting
static inline void ledBusy() { ledRGB(0,   80, 255); } // blue  — SD / dictionary work
static inline void ledOk()   { ledRGB(0,  255,   0); } // green — success
static inline void ledErr()  { ledRGB(255,  0,   0); } // red   — error
static inline void ledBlinkOk(uint16_t ms = 150) { ledOk(); delay(ms); ledOff(); }
static void ledSet(bool on) { if (on) ledWifi(); else ledOff(); }
#endif // HAS_ACT_LED

// Game config (SPIFFS: /scrab_cfg.json) — currently just the language.
static void cfgLoad() {
  File f = SPIFFS.open("/scrab_cfg.json", FILE_READ);
  if (!f) return;
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return;
  uint8_t l = d["lang"].as<uint8_t>();
  if (l <= LANG_EN) g_lang = l;
  if (!d["cpucommon"].isNull()) g_cpuCommon = d["cpucommon"].as<bool>();
  if (!d["grid"].isNull()) {
    strncpy(g_gridName, d["grid"].as<const char *>(), GRID_NAME_MAX - 1);
    g_gridName[GRID_NAME_MAX - 1] = 0;
  }
  if (!d["luck"].isNull())      g_luckHelper = d["luck"].as<bool>();
  if (!d["cross"].isNull())     g_crossLimit = d["cross"].as<uint8_t>();
  if (g_crossLimit < 1 || g_crossLimit > 5) g_crossLimit = MAX_CROSS_WORDS;
}
static void cfgSave() {
  JsonDocument d;
  d["lang"] = g_lang;
  d["cpucommon"] = g_cpuCommon;
  d["luck"] = g_luckHelper;
  d["cross"] = g_crossLimit;
  d["grid"] = g_gridName;
  File w = SPIFFS.open("/scrab_cfg.json", FILE_WRITE);
  if (!w) return;
  serializeJson(d, w);
  w.close();
}

// Saved WiFi networks (SPIFFS: /scrab_wifi.json = {"nets":[{"s","p"}]})
static const int WIFI_MAX_SAVED = 12;
static int wifiLoad(String *ss, String *pp, int maxN) {
  File f = SPIFFS.open("/scrab_wifi.json", FILE_READ);
  if (!f) return 0;
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return 0;
  JsonArray a = d["nets"].as<JsonArray>();
  if (a.isNull()) return 0;
  int n = 0;
  for (JsonVariant v : a) {
    if (n >= maxN) break;
    ss[n] = v["s"].as<String>();
    pp[n] = v["p"].as<String>();
    n++;
  }
  return n;
}
static void wifiWriteAll(String *ss, String *pp, int n) {
  JsonDocument d;
  JsonArray a = d["nets"].to<JsonArray>();
  for (int i = 0; i < n; i++) {
    JsonObject o = a.add<JsonObject>();
    o["s"] = ss[i];
    o["p"] = pp[i];
  }
  File w = SPIFFS.open("/scrab_wifi.json", FILE_WRITE);
  if (!w) return;
  serializeJson(d, w);
  w.close();
}
// Add/update a network, moving it to the front (most-recent-first).
static void wifiSave(const String &ssid, const String &pass) {
  String ss[WIFI_MAX_SAVED], pp[WIFI_MAX_SAVED];
  int n = wifiLoad(ss, pp, WIFI_MAX_SAVED);
  String os[WIFI_MAX_SAVED], op[WIFI_MAX_SAVED];
  int m = 0;
  os[m] = ssid; op[m] = pass; m++;                 // new entry first
  for (int i = 0; i < n && m < WIFI_MAX_SAVED; i++) {
    if (ss[i] == ssid) continue;                   // drop old duplicate
    os[m] = ss[i]; op[m] = pp[i]; m++;
  }
  wifiWriteAll(os, op, m);
}
static String wifiPassFor(const String &ssid) {
  String ss[WIFI_MAX_SAVED], pp[WIFI_MAX_SAVED];
  int n = wifiLoad(ss, pp, WIFI_MAX_SAVED);
  for (int i = 0; i < n; i++) if (ss[i] == ssid) return pp[i];
  return "";
}
static void wifiForget(const String &ssid) {
  String ss[WIFI_MAX_SAVED], pp[WIFI_MAX_SAVED];
  int n = wifiLoad(ss, pp, WIFI_MAX_SAVED);
  String os[WIFI_MAX_SAVED], op[WIFI_MAX_SAVED];
  int m = 0;
  for (int i = 0; i < n; i++) {
    if (ss[i] == ssid) continue;
    os[m] = ss[i]; op[m] = pp[i]; m++;
  }
  wifiWriteAll(os, op, m);
}

// Battery fuel gauge (MAX17048, I2C 0x36, shared bus)
// SOC register 0x04: high byte = integer %, low byte = 1/256 % (discarded).
static int      g_battPct = -1;      // -1 = unknown / gauge absent
static bool     g_battOk  = false;
static uint32_t g_battMs  = 0;
static void battInit() {
  Wire.beginTransmission(0x36);
  g_battOk = (Wire.endTransmission() == 0);
  Serial.println(g_battOk ? F("[Battery] MAX17048 OK") : F("[Battery] MAX17048 not found"));
}
static void battUpdate() {
  if (!g_battOk) return;
  Wire.beginTransmission(0x36);
  Wire.write(0x04);                          // SOC register
  if (Wire.endTransmission(false) != 0) { g_battOk = false; return; }
  Wire.requestFrom((uint8_t)0x36, (uint8_t)2);
  if (Wire.available() < 2) return;
  uint8_t hi = Wire.read();
  Wire.read();                               // fractional byte — discard
  g_battPct = (hi > 100) ? 100 : hi;
  g_battMs  = millis();
}

// True while a saved-network connect attempt is in flight (header icon = yellow).
static volatile bool g_wifiConnecting = false;

// Rendering helpers
// One 90°-wide WiFi arc (a real wifi-fan wedge: ±45° around straight up),
// plotted point-by-point so it doesn't depend on any drawArc angle convention.
static void wifiArc(int cx, int cy, int r, uint16_t c) {
  for (int deg = -45; deg <= 45; deg += 2) {
    float a = deg * 0.0174533f;
    int x = cx + (int)lroundf(r * sinf(a));
    int y = cy - (int)lroundf(r * cosf(a));
    tft->drawPixel(x, y, c);
  }
}

// Compact memory figures for the status bar, Marauder-style: "182k" / "3.9M".
// Deliberately terse — the header only has ~70 px to spare next to the title.
static String memShort(size_t bytes) {
  if (bytes >= 1024UL * 1024UL) {
    uint32_t tenths = (uint32_t)((bytes * 10ULL) / (1024ULL * 1024ULL));
    return String(tenths / 10) + "." + String(tenths % 10) + "M";
  }
  return String((uint32_t)(bytes / 1024)) + "k";
}

