H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
// Sprite twins of the two settings row styles.
//
// The Settings list scrolls now, and scrolling has to composite: redrawing rows
// straight to the panel while a drag is in flight is exactly the flashing this
// firmware avoids everywhere else. TFT_eSprite's fillRect/drawChar are not
// virtual, so these are written out against TFT_eSprite rather than shared with
// the tft versions above — the same reason dstRow() in the Letters editor is.
static void sprChipRow(TFT_eSprite &spr, const uint8_t *&track, int y,
                       const String &label, const String &val, bool pm,
                       bool sel, uint16_t valcol) {
  uint16_t rbg = sel ? COL_SEL : COL_BG;
  int seed = y / ITEMH;
  spr.fillRect(0, y, SCRW, ITEMH, rbg);
  spr.setTextColor(COL_FG, rbg);
  spr.setTextDatum(ML_DATUM);
  sprStr(spr, track, label, 12, y + ITEMH / 2, 2);

  int by = y + (ITEMH - CHIP_H) / 2, fwd_bx, bwd_bx, vx;
  chipGeom(val, fwd_bx, bwd_bx, vx);
  spr.fillRoundRect(fwd_bx, by, CHIP_W, CHIP_H, 4, COL_ACCENT);
  spr.drawRoundRect(fwd_bx, by, CHIP_W, CHIP_H, 4, theme.neon(seed, COL_DIM));
  spr.fillRoundRect(bwd_bx, by, CHIP_W, CHIP_H, 4, COL_ACCENT);
  spr.drawRoundRect(bwd_bx, by, CHIP_W, CHIP_H, 4, theme.neon(seed + 4, COL_DIM));

  int fcx = fwd_bx + CHIP_W / 2, bcx = bwd_bx + CHIP_W / 2, cy = by + CHIP_H / 2;
  if (pm) {
    const int r = 6;
    spr.fillRect(bcx - r, cy - 1, 2 * r, 2, COL_FG);
    spr.fillRect(fcx - r, cy - 1, 2 * r, 2, COL_FG);
    spr.fillRect(fcx - 1, cy - r, 2, 2 * r, COL_FG);
  } else {
    spr.fillTriangle(bcx + 3, cy - 5, bcx + 3, cy + 5, bcx - 4, cy, COL_FG);
    spr.fillTriangle(fcx - 3, cy - 5, fcx - 3, cy + 5, fcx + 4, cy, COL_FG);
  }

  spr.setTextColor(valcol ? valcol : COL_FG, rbg);
  spr.setTextDatum(ML_DATUM);
  sprStr(spr, track, val, vx, y + ITEMH / 2, 2);
  spr.drawFastHLine(0, y + ITEMH - 1, SCRW, theme.neon(seed, theme.edge()));
  spr.setTextDatum(TL_DATUM);
}

static void sprInfoRow(TFT_eSprite &spr, const uint8_t *&track, int y,
                       const String &label, const String &val, bool sel) {
  uint16_t rbg = sel ? COL_SEL : COL_BG;
  int seed = y / ITEMH;
  spr.fillRect(0, y, SCRW, ITEMH, rbg);
  spr.setTextColor(COL_FG, rbg);
  spr.setTextDatum(ML_DATUM);
  sprStr(spr, track, label, 12, y + ITEMH / 2, 2);
  if (val.length()) {
    spr.setTextColor(COL_DIM, rbg);
    spr.setTextDatum(MR_DATUM);
    sprStr(spr, track, val, SCRW - 32, y + ITEMH / 2, 2);
    spr.setTextDatum(ML_DATUM);
  }
  int cx = SCRW - 26 + 8, cy = y + ITEMH / 2;
  spr.fillTriangle(cx - 3, cy - 5, cx - 3, cy + 5, cx + 4, cy, theme.neon(seed, COL_DIM));
  spr.drawFastHLine(0, y + ITEMH - 1, SCRW, theme.neon(seed, theme.edge()));
  spr.setTextDatum(TL_DATUM);
}

// Centred message screen with a Back header: headline `a` + optional detail `b`
// (word-wrapped so long reasons stay readable). Blocks for a tap.
static void msgScreen(const char *title, const String &a, const String &b, uint16_t col) {
  tft->fillScreen(COL_BG);
  drawHeader(title, true);
  tft->setTextColor(col, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr(a, SCRW / 2, SCRH / 2 - 20, 2);
  if (b.length()) {
    tft->setTextColor(COL_DIM, COL_BG);
    int y = SCRH / 2 + 6, maxW = SCRW - 24;
    String line = "", rest = b;
    while (rest.length() && y < SCRH - 20) {
      int sp = rest.indexOf(' ');
      String word = (sp < 0) ? rest : rest.substring(0, sp);
      String cand = line.length() ? line + " " + word : word;
      if (strWidth(cand.c_str(), 2) <= maxW) { line = cand; }
      else { drawStr(line, SCRW / 2, y, 2); y += 20; line = word; }
      rest = (sp < 0) ? "" : rest.substring(sp + 1);
    }
    if (line.length() && y < SCRH - 20) drawStr(line, SCRW / 2, y, 2);
  }
  tft->setTextDatum(TL_DATUM);
  uint16_t x, y2; waitTap(x, y2);
}

// WiFi
// Last STA disconnect reason (WIFI_REASON_*): 15 = 4-way handshake timeout
// (usually wrong password), 201 = no AP found (band/channel), 205 = conn fail.
static volatile int g_wifiReason = 0;
static volatile int g_wifiEvt = -1;   // last Arduino WiFi event id (-1 = none seen)
static bool g_manualDisconnect = false;   // user tapped Disconnect — don't auto-reconnect
static void wifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  g_wifiEvt = (int)event;
  if (event == ARDUINO_EVENT_WIFI_STA_DISCONNECTED)
    g_wifiReason = info.wifi_sta_disconnected.reason;
}

// Poll for association up to timeoutMs, animating a "connecting..." line at
// `spinnerY`. Tapping the screen cancels (returns false).
static bool waitConnect(uint32_t timeoutMs, int spinnerY) {
  uint32_t start = millis(), lastAnim = 0;
  bool wasDown = touch->isPressed();
  int dots = 0;
  while (WiFi.status() != WL_CONNECTED && (millis() - start) < timeoutMs) {
    touch->run();
    bool down = touch->isPressed();
    if (down && !wasDown) return false;    // tap to cancel
    wasDown = down;
    if (millis() - lastAnim > 350) {
      lastAnim = millis();
      String d = "connecting";
      for (int i = 0; i < (dots = (dots + 1) % 4); i++) d += ".";
      tft->fillRect(0, spinnerY, SCRW, 20, COL_BG);
      tft->setTextColor(COL_DIM, COL_BG); tft->setTextDatum(MC_DATUM);
      drawStr(d, SCRW / 2, spinnerY + 8, 2);
      tft->setTextDatum(TL_DATUM);
    }
    delay(30);
  }
  return WiFi.status() == WL_CONNECTED;
}

// Blocking connect with a clean loading screen. FlipperHTTP's ESP32-C5 approach:
// setBandMode(AUTO) + a plain WiFi.begin() — no scan / BSSID pin / radio cycle.
// setBandMode(AUTO) is THE C5-specific line: it lets the dual-band radio pick.
static bool connectWiFi(const String &ssid, const String &pass) {
  g_wifiConnecting = true;
  g_manualDisconnect = false;                // an explicit connect re-enables auto-reconnect
  ledWifi();
  g_wifiReason = 0;
  g_wifiEvt = -1;
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.scanDelete();                         // free any prior scan (harmless if none)
  WiFi.setBandMode(WIFI_BAND_MODE_AUTO);     // dual-band C5: auto-select the band
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid.c_str(), pass.c_str());
  WiFi.setAutoReconnect(false);

  tft->fillScreen(COL_BG);
  drawHeader("WiFi", true);
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("Connecting to", SCRW / 2, SCRH / 2 - 22, 2);
  tft->setTextColor(COL_FG, COL_BG);
  drawStr(String("\"") + ssid + "\"", SCRW / 2, SCRH / 2 + 4, 4);
  tft->setTextDatum(TL_DATUM);

