H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
  bool ok = waitConnect(12000, SCRH / 2 + 34);
  g_wifiConnecting = false;
  ledOff();
  return ok;
}

static bool connectSaved(const String &ssid) {
  return connectWiFi(ssid, wifiPassFor(ssid));
}

// Background (re)connect — NON-BLOCKING so the menu stays responsive. An async
// scan orders the saved networks by signal strength (closest first); then it
// connects to each in turn. Driven from loop() via wifiBgTick().
enum WbState { WB_IDLE, WB_SCAN, WB_CONNECT, WB_DONE };
static WbState  g_wb  = WB_IDLE;
static uint32_t g_wbT = 0;
static String   g_wbSs[WIFI_MAX_SAVED], g_wbPp[WIFI_MAX_SAVED];
static int      g_wbN = 0, g_wbIdx = 0;

static void wifiBgTry() {                     // begin() on the current saved network
  g_wifiReason = 0; g_wifiEvt = -1;
  WiFi.begin(g_wbSs[g_wbIdx].c_str(), g_wbPp[g_wbIdx].c_str());
  WiFi.setAutoReconnect(false);
  g_wbT = millis();
}

static void wifiBgBegin() {
  g_wbN = wifiLoad(g_wbSs, g_wbPp, WIFI_MAX_SAVED);
  if (g_wbN == 0) { g_wb = WB_IDLE; return; }
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.setBandMode(WIFI_BAND_MODE_AUTO);
  WiFi.mode(WIFI_STA);
  WiFi.scanNetworks(true);                    // async — order by RSSI when it completes
  g_wbT = millis();
  g_wb = WB_SCAN;
  g_wifiConnecting = true;
}

static void wifiBgTick() {
  if (g_wb == WB_SCAN) {
    int r = WiFi.scanComplete();
    if (r == WIFI_SCAN_RUNNING && millis() - g_wbT < 6000) return;   // wait for the scan (<=6s)
    if (r > 0) {
      // Best RSSI of each saved net (−999 = out of range), then sort desc (closest first).
      int rssi[WIFI_MAX_SAVED];
      for (int i = 0; i < g_wbN; i++) {
        rssi[i] = -999;
        for (int j = 0; j < r; j++)
          if (WiFi.SSID(j) == g_wbSs[i] && WiFi.RSSI(j) > rssi[i]) rssi[i] = WiFi.RSSI(j);
      }
      for (int a = 0; a < g_wbN - 1; a++) {
        int best = a;
        for (int b = a + 1; b < g_wbN; b++) if (rssi[b] > rssi[best]) best = b;
        if (best != a) {
          int tr = rssi[a]; rssi[a] = rssi[best]; rssi[best] = tr;
          String ts = g_wbSs[a]; g_wbSs[a] = g_wbSs[best]; g_wbSs[best] = ts;
          String tp = g_wbPp[a]; g_wbPp[a] = g_wbPp[best]; g_wbPp[best] = tp;
        }
      }
    }
    WiFi.scanDelete();
    g_wbIdx = 0;
    wifiBgTry();
    g_wb = WB_CONNECT;
    return;
  }
  if (g_wb == WB_CONNECT) {
    if (WiFi.status() == WL_CONNECTED) { g_wifiConnecting = false; g_wb = WB_DONE; return; }
    // Try only the two closest saved networks (once each, 8 s), then give up and
    // stay disconnected so the LED isn't lit the whole time we're offline.
    int maxTry = g_wbN < 2 ? g_wbN : 2;
    if (millis() - g_wbT > 8000) {
      if (++g_wbIdx >= maxTry) { g_wifiConnecting = false; g_wb = WB_DONE; return; }
      wifiBgTry();
    }
  }
}

// Scan / pick / password / connect flow. Smooth-scroll list, no paging.
static void scanFlow() {
  static String rows[41];
  for (;;) {
    tft->fillScreen(COL_BG);
    drawHeader("Scan", true);
    tft->setTextColor(COL_DIM, COL_BG);
    tft->setTextDatum(MC_DATUM);
    drawStr("Scanning...", SCRW / 2, SCRH / 2, 2);
    tft->setTextDatum(TL_DATUM);
    ledSet(true);
    int nnet = WiFi.scanNetworks();
    ledSet(false);
    int rc = (nnet < 0) ? 0 : nnet;

    for (int i = 0; i < rc && i < 41; i++)
      rows[i] = WiFi.SSID(i) + "   ch" + WiFi.channel(i) + "  (" + WiFi.RSSI(i) + ")";

    int sel = scrollList("Scan", rows, rc, true, "Back", "Rescan", "");
    if (sel == SL_BACK || sel == SL_F0) return;        // Back
    if (sel == SL_F1) continue;                        // Rescan

    int idx = sel;
    if (idx < 0 || idx >= rc) continue;
    String ssid = WiFi.SSID(idx);
    char pass[65] = {0};
    String sp = wifiPassFor(ssid);
    if (sp.length()) strncpy(pass, sp.c_str(), sizeof(pass) - 1);
    if (!touchKeyboardInput(*tft, COL_FG, COL_BG, pass, sizeof(pass),
                            (String("Password: ") + ssid).c_str(), true)) continue;
    if (connectWiFi(ssid, pass)) {
      wifiSave(ssid, pass);
      statusLine("Connected!", COL_OK);
      uint16_t a, bb; waitTap(a, bb);
      return;
    }
    statusLine((String("Failed (reason ") + g_wifiReason + "). Tap to re-scan.").c_str(), TFT_RED);
    uint16_t a, bb; waitTap(a, bb);
  }
}

// WiFi Setup: saved networks (tap to connect) with a [Disconnect][Scan][Forget]
// footer. The header chevron is Back; the footer left button disconnects WiFi.
static void wifiSetup() {
  static String rows[WIFI_MAX_SAVED];
  for (;;) {
    String ss[WIFI_MAX_SAVED], pp[WIFI_MAX_SAVED];
    int n = wifiLoad(ss, pp, WIFI_MAX_SAVED);
    for (int i = 0; i < n; i++) {
      bool cur = (WiFi.status() == WL_CONNECTED && WiFi.SSID() == ss[i]);
      rows[i] = (cur ? String("* ") : String("")) + ss[i];
    }
    int sel = scrollList("WiFi Setup", rows, n, true, "Disconnect", "Scan", n > 0 ? "Forget" : "");
    if (sel == SL_BACK) return;                            // header back
    if (sel == SL_F0) { WiFi.disconnect(true); g_manualDisconnect = true; continue; }
    if (sel == SL_F1) { scanFlow(); continue; }
    if (sel == SL_F2 && n > 0) {                           // Forget — pick a saved net
      static String frows[WIFI_MAX_SAVED];
      for (int i = 0; i < n; i++) frows[i] = ss[i];
      int f = scrollList("Forget", frows, n, true);
      if (f >= 0 && f < n) wifiForget(ss[f]);
      continue;
    }
    if (sel >= 0 && sel < n) connectSaved(ss[sel]);        // tap a saved network
  }
}

// WiFi Debug: live status/event/reason + heap, with reconnect actions.
static void wifiDebug() {
  // Repaint only when something actually changed. Repainting per tap made this
  // flash on any stray touch.
  bool repaint = true;
  for (;;) {
   if (repaint) {
    repaint = false;
    tft->fillScreen(COL_BG);
    drawHeader("WiFi Debug", true);
    int y = CONTENTY + 10;
    tft->setTextColor(COL_FG, COL_BG);
    tft->setTextDatum(TL_DATUM);
    auto line = [&](const String &s) { drawStr(s, 12, y, 2); y += 24; };
    bool up = (WiFi.status() == WL_CONNECTED);
    line(String("Status:       ") + WiFi.status() + (up ? "  (connected)" : ""));
    line(String("Last event:   ") + g_wifiEvt);
    line(String("Disc reason:  ") + g_wifiReason);
    line(String("SSID:         ") + (up ? WiFi.SSID() : String("-")));
    line(String("Channel:      ") + (up ? String(WiFi.channel()) : String("-")));
    line(String("IP:           ") + (up ? WiFi.localIP().toString() : String("-")));
    line(String("RSSI:         ") + (up ? String(WiFi.RSSI()) : String("-")));
    line(String("Free heap:    ") + ESP.getFreeHeap());
    line(String("Free PSRAM:   ") + ESP.getFreePsram());
    drawNav("Disconnect", "", "Reconnect");
   }

    uint16_t x, ty;
    if (!waitTap(x, ty)) continue;
    if (backTapped(x, ty)) return;                 // header back
    int nh = navHit(x, ty);
    if (nh == 0) { WiFi.disconnect(true); g_manualDisconnect = true; repaint = true; continue; }
    if (nh == 2) {
      repaint = true;
      String ss[WIFI_MAX_SAVED], pp[WIFI_MAX_SAVED];
      int n = wifiLoad(ss, pp, WIFI_MAX_SAVED);
      if (n) connectSaved(ss[0]);
    }
  }
}

// Word list
// Load the .dwg for the active language into PSRAM, with a progress screen —
// it is a ~2 MB SD read and takes a noticeable moment.
static bool dictLoad(bool showProgress) {
  if (showProgress) {
    tft->fillScreen(COL_BG);
    drawHeader("Dictionary", true);
    tft->setTextColor(COL_DIM, COL_BG);
    tft->setTextDatum(MC_DATUM);
    drawStr(String("Loading ") + LANG_NAMES[g_lang] + " word list...",
                    SCRW / 2, SCRH / 2, 2);
    tft->setTextDatum(TL_DATUM);
  }
  ledBusy();
  uint32_t t0 = millis();
  bool ok = g_dawg.load(LANG_FILES[g_lang]);
  uint32_t ms = millis() - t0;
  ledOff();
  if (ok) {
    Serial.printf("[Dict] %s: %lu words, %lu edges, %u KB in %lu ms\n",
                  LANG_FILES[g_lang], (unsigned long)g_dawg.wordCount(),
                  (unsigned long)g_dawg.edgeCount(),
                  (unsigned)(g_dawg.bytes() / 1024), (unsigned long)ms);
  } else {
    Serial.printf("[Dict] %s failed: %s\n", LANG_FILES[g_lang], g_dawg.error());
  }
  return ok;
}

// Convert typed text to the firmware's letter bytes: upper-case, and fold the
// UTF-8 umlauts the keyboard can produce into the private codes the word lists
// use (0x80 Ä, 0x82 Ö, 0x84 Ü). Case is folded because tiles are upper-case
// only, so ä and Ä are the same tile.
//
// ß EXPANDS TO SS, matching generate_scrabble_dict.py: there is no eszett tile
// in the German set, so a word containing one is played as two S. Typing ß and
// having it silently fail to match would be the confusing alternative.
static uint8_t normaliseWord(const char *in, uint8_t *out, uint8_t maxLen) {
  uint8_t n = 0;
  for (const uint8_t *p = (const uint8_t *)in; *p && n < maxLen; p++) {
    uint8_t c = *p;
    if (c == 0xC3 && p[1]) {                    // 2-byte UTF-8 Latin-1 supplement
      uint8_t d = *++p;
      switch (d) {
        case 0x84: case 0xA4: out[n++] = 0x80; break;   // A/a umlaut
        case 0x96: case 0xB6: out[n++] = 0x82; break;   // O/o umlaut
        case 0x9C: case 0xBC: out[n++] = 0x84; break;   // U/u umlaut
        case 0x9F:                                      // eszett -> SS
          out[n++] = 'S';
          if (n < maxLen) out[n++] = 'S';
          break;
        default: return 0;                              // not a playable letter
      }
    } else if (c >= 'a' && c <= 'z') {
      out[n++] = c - 'a' + 'A';
    } else if (c >= 'A' && c <= 'Z') {
      out[n++] = c;
    } else if (c == 0x80 || c == 0x82 || c == 0x84) {
      out[n++] = c;                              // Ä Ö Ü straight from the keyboard
    } else if (c == 0x81 || c == 0x83 || c == 0x85) {
      out[n++] = c - 1;                          // ä ö ü -> upper-case tile
    } else if (c == 0x86) {                      // ß -> SS, as above
      out[n++] = 'S';
      if (n < maxLen) out[n++] = 'S';
    } else {
      return 0;                                  // space, digit, punctuation
    }
  }
  return n;
}

// Letter bytes back to a drawable string. With the VLW fonts this is a straight
// copy — the private codes ARE the glyphs, so no transliteration is needed.
static String wordDisplay(const uint8_t *w, uint8_t len) {
  String s;
  for (uint8_t i = 0; i < len; i++) s += (char)w[i];
  return s;
}

// Board Builder — the premium-square layout, editable.
//
// A grid of cells above a tray of bonus tiles. Pick a bonus from the tray, then
// tap squares to lay it down; tapping a square that already carries the selected
// bonus takes it back off, and the Erase brush clears whatever is there.
//
// A tap paints the cell's whole SYMMETRY ORBIT — both mirrors and the transpose.
// An asymmetric board gives one
// axis more scoring potential than the other, and because the opponent searches
// both axes evenly, that would surface as the CPU looking biased for a reason
// that is really the board's. See boardgrid.h.
//
// The counts line is the premium budget. Classic spends DL 24 / TL 20 / DW 16 /
// TW 8 plus the star; staying near that keeps a custom board scoring like the
// real one rather than turning into a points fountain.
static const int BB_TRAYH = (SCRH > 400) ? 40 : 26;
static const int BB_TRAYY = SCRH - NAVH - BB_TRAYH - 6;
static const int BB_CELL  = (SCRW - 20) / GRID_N;         // 20 px on Pancake
static const int BB_X0    = (SCRW - BB_CELL * GRID_N) / 2;
static const int BB_Y0    = CONTENTY + 20;
// Name and premium counts share one line. They used to be two, which fit on the
// Pancake and overflowed the V8 by a row once the tray was added.
static const int BB_INFOY = CONTENTY + 4;

// The tray: four bonuses plus an eraser.
static const uint8_t BB_BRUSH[5] = { PR_DL, PR_TL, PR_DW, PR_TW, PR_NONE };
static uint8_t g_bbBrush = PR_DL;

static uint16_t bbFill(uint8_t p) {
  BoardPal P = theme.board();
  return p == PR_DL ? P.dl : p == PR_TL ? P.tl
       : p == PR_DW ? P.dw : p == PR_TW ? P.tw
       : p == PR_CENTRE ? P.dw : P.empty;
}
static const char *bbLabel(uint8_t p) {
  return p == PR_DL ? "DL" : p == PR_TL ? "TL"
       : p == PR_DW ? "DW" : p == PR_TW ? "TW"
       : p == PR_CENTRE ? "*" : "";
}

static void bbDrawCell(uint8_t r, uint8_t c) {
  BoardPal P = theme.board();
  Premium p = premiumAt(r, c);
  uint16_t fill = bbFill(p);
  int x = BB_X0 + c * BB_CELL, y = BB_Y0 + r * BB_CELL;
  tft->fillRect(x, y, BB_CELL - 1, BB_CELL - 1, fill);
  const char *lab = bbLabel(p);
  if (lab[0]) {
    tft->setTextColor(P.prem_text, fill);
    tft->setTextDatum(MC_DATUM);
    drawStr(lab, x + (BB_CELL - 1) / 2, y + (BB_CELL - 1) / 2, 1);
    tft->setTextDatum(TL_DATUM);
  }
}

// Name on the left, premium budget on the right.
static void bbDrawInfo() {
  uint8_t n[6];
  gridCounts(n);
  tft->fillRect(0, BB_INFOY - 2, SCRW, 18, COL_BG);
  tft->setTextDatum(TL_DATUM);
  tft->setTextColor(COL_FG, COL_BG);
  drawStr(g_gridName, BB_X0, BB_INFOY, 2);
  tft->setTextDatum(TR_DATUM);
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr(String(n[PR_DL]) + "/" + n[PR_TL] + "/" + n[PR_DW] + "/" + n[PR_TW],
          SCRW - BB_X0, BB_INFOY, 2);
  tft->setTextDatum(TL_DATUM);
}

static int bbTrayW() { return (SCRW - 2 * BB_X0) / 5; }

static void bbDrawTray() {
  BoardPal P = theme.board();
  int tw = bbTrayW();
  tft->fillRect(0, BB_TRAYY - 2, SCRW, BB_TRAYH + 4, COL_BG);
  for (uint8_t i = 0; i < 5; i++) {
    uint8_t p = BB_BRUSH[i];
    int x = BB_X0 + i * tw, w = tw - 6;
    bool sel = (p == g_bbBrush);
    tft->fillRoundRect(x, BB_TRAYY, w, BB_TRAYH, 5, bbFill(p));
    // The selected brush is ringed in the accent colour; the others get the
    // board's own edge so the tray reads as part of the board.
    tft->drawRoundRect(x, BB_TRAYY, w, BB_TRAYH, 5, sel ? COL_ACCENT : P.tile_edge);
    if (sel) tft->drawRoundRect(x + 1, BB_TRAYY + 1, w - 2, BB_TRAYH - 2, 4, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
    tft->setTextColor(p == PR_NONE ? COL_DIM : P.prem_text, bbFill(p));
    drawStr(p == PR_NONE ? "X" : bbLabel(p), x + w / 2, BB_TRAYY + BB_TRAYH / 2, 2);
    tft->setTextDatum(TL_DATUM);
  }
}

