H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
// Which tray swatch a tap landed on, or -1.
static int bbTrayHit(uint16_t x, uint16_t y) {
  if ((int)y < BB_TRAYY || (int)y >= BB_TRAYY + BB_TRAYH) return -1;
  int tw = bbTrayW();
  int i = ((int)x - BB_X0) / tw;
  if ((int)x < BB_X0 || i < 0 || i > 4) return -1;
  return i;
}

static void bbDrawAll() {
  tft->fillScreen(COL_BG);
  drawHeader("Board Builder", true);
  bbDrawInfo();
  for (uint8_t r = 0; r < GRID_N; r++)
    for (uint8_t c = 0; c < GRID_N; c++) bbDrawCell(r, c);
  bbDrawTray();
  drawNav("New", "Load", "Save");
}

static void boardBuilderScreen() {
  bbDrawAll();
  for (;;) {
    uint16_t x, y;
    if (!waitTap(x, y)) continue;
    // The header chevron is the way out now that the footer's left slot is New.
    if (backTapped(x, y)) return;

    int nh = navHit(x, y);

    if (nh == 0) {                               // New — a blank board
      for (uint16_t i = 0; i < GRID_CELLS; i++) g_grid[i] = PR_NONE;
      g_grid[(GRID_N / 2) * GRID_N + GRID_N / 2] = PR_CENTRE;
      strncpy(g_gridName, "Untitled", GRID_NAME_MAX - 1);
      g_gridName[GRID_NAME_MAX - 1] = 0;
      bbDrawAll();
      continue;
    }

    if (nh == 1) {                               // Load
      String rows[GRID_MAX_SAVED + 4];
      uint8_t n = 0;
      for (uint8_t i = 0; i < gridBuiltinCount(); i++) rows[n++] = gridBuiltinName(i);
      uint8_t nb = n;
      String saved[GRID_MAX_SAVED];
      uint8_t ns = gridListSaved(saved, GRID_MAX_SAVED);
      for (uint8_t i = 0; i < ns && n < GRID_MAX_SAVED + 4; i++) rows[n++] = saved[i];
      int pick = scrollList("Load Board", rows, n, true);
      if (pick >= 0) {
        if (pick < (int)nb) gridLoadBuiltin((uint8_t)pick);
        else                gridLoad(rows[pick].c_str());
        cfgSave();
      }
      bbDrawAll();
      continue;
    }

    if (nh == 2) {                               // Save
      char nm[GRID_NAME_MAX] = {0};
      strncpy(nm, g_gridName, GRID_NAME_MAX - 1);
      // A built-in cannot be overwritten, so do not offer its name back as the
      // default and have the save land somewhere the Load list will not show.
      if (!strcmp(nm, "Classic") || !strcmp(nm, "Random")) nm[0] = 0;
      if (touchKeyboardInput(*tft, COL_FG, COL_BG, nm, sizeof(nm), "Board name:", false) && nm[0]) {
        if (gridSave(nm)) { cfgSave(); msgScreen("Board Builder", "Saved", nm, COL_OK); }
        else              msgScreen("Board Builder", "Could not save",
                                    "Check the SD card is present and writable.", TFT_RED);
      }
      bbDrawAll();
      continue;
    }

    int t = bbTrayHit(x, y);
    if (t >= 0) {
      g_bbBrush = BB_BRUSH[t];
      bbDrawTray();
      continue;
    }

    // A tap on the grid lays the selected bonus, and its mirrors with it.
    if ((int)x < BB_X0 || (int)y < BB_Y0) continue;
    int cx = ((int)x - BB_X0) / BB_CELL, cy = ((int)y - BB_Y0) / BB_CELL;
    if (cx >= GRID_N || cy >= GRID_N) continue;
    // Tapping a square that already holds the brush takes it back off, so one
    // brush covers both placing and removing without a trip to the eraser.
    uint8_t cur = premiumAt((uint8_t)cy, (uint8_t)cx);
    gridPaint((uint8_t)cy, (uint8_t)cx, (cur == g_bbBrush) ? PR_NONE : g_bbBrush);

    // Repaint only the squares the orbit could have touched, so the board never
    // flashes. The orbit lives entirely within rows/columns cy, cx and their
    // mirrors, so those four lines crossed with themselves cover it.
    const uint8_t m = GRID_N - 1;
    uint8_t lines[4] = { (uint8_t)cy, (uint8_t)(m - cy), (uint8_t)cx, (uint8_t)(m - cx) };
    for (uint8_t li = 0; li < 4; li++)
      for (uint8_t k = 0; k < 4; k++) {
        bbDrawCell(lines[li], lines[k]);
        bbDrawCell(lines[k], lines[li]);
      }
    bbDrawInfo();
  }
}

// Dictionary Editor — overrides on top of the loaded word list.
//
// Look a word up, then block it or allow it, and browse what you have changed.
// The list rows carry a remove action. What is stored is the edit, not a new
// dictionary — see wordedit.h, including the one real limitation (an allowed
// word is playable by you but unreachable by the opponent, which finds its
// moves by walking the DAWG).
static void dictListScreen(WordStatus which) {
  const char *title = (which == WS_BLOCKED) ? "Blocked Words" : "Allowed Words";
  for (;;) {
    uint8_t n = weCount(g_lang, which);
    if (!n) {
      msgScreen(title, "Nothing here yet",
                which == WS_BLOCKED
                  ? "Look a word up and block it to keep it out of play."
                  : "Look a word up and allow it to play a word the list lacks.",
                COL_DIM);
      return;
    }
    static String rows[WE_MAX_WORDS];
    for (uint8_t i = 0; i < n; i++) {
      uint8_t w[WE_MAX_LEN];
      uint8_t len = weAt(g_lang, which, i, w);
      rows[i] = wordDisplay(w, len);
    }
    int pick = scrollList(title, rows, n, true);
    if (pick < 0) return;
    uint8_t w[WE_MAX_LEN];
    uint8_t len = weAt(g_lang, which, (uint8_t)pick, w);
    if (len) weSet(g_lang, w, len, WS_NORMAL);   // the row's remove action
  }
}

static void dictionaryScreen() {
  if (!g_dawg.loaded() && !dictLoad(true)) {
    msgScreen("Dictionary Editor", "Word list not loaded",
              String(LANG_FILES[g_lang]) + " - " + g_dawg.error() +
              ". Copy the .dwg files to " SCRABBLE_DIR " on the SD card.", TFT_RED);
    return;
  }

  char buf[24] = {0};
  uint8_t w[WE_MAX_LEN];
  uint8_t wn = 0;
  bool repaint = true;
  // Looked up once per word, not once per repaint: the offline lookup bisects a
  // multi-megabyte file on the SD card, and blocking/allowing repaints often.
  String def;
  bool defOnline = false;

  for (;;) {
   if (repaint) {
    repaint = false;
    tft->fillScreen(COL_BG);
    drawHeader("Dictionary Editor", true);

    int y = CONTENTY + 14;
    tft->setTextDatum(TL_DATUM);
    tft->setTextColor(COL_DIM, COL_BG);
    drawStr(String(LANG_NAMES[g_lang]) + " word list", 12, y, 2); y += 22;
    drawStr(String(g_dawg.wordCount()) + " words", 12, y, 2); y += 22;
    drawStr(String("blocked ") + weCount(g_lang, WS_BLOCKED) +
            "   allowed " + weCount(g_lang, WS_ALLOWED), 12, y, 2); y += 28;

