H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
    if (wn) {
      bool inDict = g_dawg.contains(w, wn);
      WordStatus st = weStatus(g_lang, w, wn);
      bool playable = wordAllowed(g_lang, w, wn, inDict);

      tft->setTextDatum(MC_DATUM);
      tft->setTextColor(COL_FG, COL_BG);
      drawStr(wordDisplay(w, wn), SCRW / 2, SCRH / 2 - 16, 4);
      tft->setTextColor(playable ? COL_OK : TFT_RED, COL_BG);
      drawStr(playable ? "PLAYABLE" : "NOT PLAYABLE", SCRW / 2, SCRH / 2 + 14, 2);
      tft->setTextColor(COL_DIM, COL_BG);
      drawStr(st == WS_BLOCKED ? "blocked by you"
            : st == WS_ALLOWED ? "allowed by you"
            : inDict           ? "in the word list"
                               : "not in the word list",
              SCRW / 2, SCRH / 2 + 36, 2);
      tft->setTextDatum(TL_DATUM);

      // The definition, wrapped into whatever room is left above the footer.
      int dy = SCRH / 2 + 54;
      const int dbot = SCRH - NAVH - 6, dlh = 17;
      tft->setTextColor(COL_DIM, COL_BG);
      drawStr(def.length() ? (defOnline ? "online" : "SD dictionary") : "no definition",
              12, dy, 1);
      dy += 14;
      tft->setTextColor(COL_FG, COL_BG);
      String cur;
      const int maxW = SCRW - 24;
      for (int i = 0; i <= (int)def.length() && dy + dlh <= dbot; i++) {
        char ch = (i < (int)def.length()) ? def[i] : (char)0x0A;
        if (ch == 0x0A) {
          if (cur.length()) { drawStr(cur, 12, dy, 2); dy += dlh; }
          cur = "";
          continue;
        }
        if (ch == ' ' && !cur.length()) continue;
        String cand = cur + ch;
        if (strWidth(cand, 2) > maxW) {
          int sp = cur.lastIndexOf(' ');
          if (sp > 0) { drawStr(cur.substring(0, sp), 12, dy, 2); cur = cur.substring(sp + 1) + ch; }
          else        { drawStr(cur, 12, dy, 2); cur = String(ch); }
          dy += dlh;
        } else {
          cur = cand;
        }
      }
      if (cur.length() && dy + dlh <= dbot) drawStr(cur, 12, dy, 2);
    } else if (buf[0]) {
      tft->setTextDatum(MC_DATUM);
      tft->setTextColor(TFT_RED, COL_BG);
      drawStr("not a playable word", SCRW / 2, SCRH / 2, 2);
      tft->setTextDatum(TL_DATUM);
    }

    // The middle action is whichever change makes sense for the word on screen.
    const char *mid = "Look Up";
    if (wn) mid = (weStatus(g_lang, w, wn) != WS_NORMAL) ? "Reset"
                : g_dawg.contains(w, wn)                 ? "Block" : "Allow";
    drawNav("Back", mid, wn ? "Clear" : "Lists");
   }

    uint16_t x, ty;
    if (!waitTap(x, ty)) continue;
    if (backTapped(x, ty)) return;
    int nh = navHit(x, ty);
    if (nh == 0) return;

    if (nh == 1) {
      if (wn) {
        WordStatus st = weStatus(g_lang, w, wn);
        weSet(g_lang, w, wn, st != WS_NORMAL ? WS_NORMAL
                           : g_dawg.contains(w, wn) ? WS_BLOCKED : WS_ALLOWED);
      } else {
        if (touchKeyboardInput(*tft, COL_FG, COL_BG, buf, sizeof(buf), "Look up word:", false)) {
          wn = normaliseWord(buf, w, sizeof(w));
          def = ""; defOnline = false;
          if (wn) {
            ledBusy();
            defineWord(g_lang, w, wn, WiFi.status() == WL_CONNECTED, def, defOnline);
            ledOff();
          }
        } else { buf[0] = 0; wn = 0; def = ""; }
      }
      repaint = true;
      continue;
    }

    if (nh == 2) {
      // With a word on screen the right button clears it, so the keyboard is
      // reachable again without leaving the screen.
      if (wn) { wn = 0; buf[0] = 0; def = ""; repaint = true; continue; }
      String rows[2] = { String("Blocked (") + weCount(g_lang, WS_BLOCKED) + ")",
                         String("Allowed (") + weCount(g_lang, WS_ALLOWED) + ")" };
      int pick = scrollList("Edited Words", rows, 2, true);
      if (pick == 0) dictListScreen(WS_BLOCKED);
      if (pick == 1) dictListScreen(WS_ALLOWED);
      repaint = true;
    }
  }
}

// Letter Distribution editor — the point value and bag count of every tile, per
// language.
//
// The list scrolls (there are 27-30 rows) and is composited into a sprite, so
// holding a stepper doesn't strobe the screen. Edits apply to the live table
// immediately and are saved on the way out; they take effect on the NEXT new
// game, since a game in progress already has its bag filled.
static const int DST_ROWH = 36;
static const int DST_CHIPW = 26, DST_CHIPH = 22;
static const int DST_VM = 60,  DST_VP = 124;    // value  [-] / [+]
static const int DST_BM = 184, DST_BP = 248;    // bag    [-] / [+]

// Which stepper a tap hit: 0 val-, 1 val+, 2 bag-, 3 bag+, -1 none.
static int dstChipAt(int x, int yInRow) {
  if (yInRow < (DST_ROWH - DST_CHIPH) / 2 ||
      yInRow >= (DST_ROWH + DST_CHIPH) / 2) return -1;
  if (x >= DST_VM && x < DST_VM + DST_CHIPW) return 0;
  if (x >= DST_VP && x < DST_VP + DST_CHIPW) return 1;
  if (x >= DST_BM && x < DST_BM + DST_CHIPW) return 2;
  if (x >= DST_BP && x < DST_BP + DST_CHIPW) return 3;
  return -1;
}

// Row 0 of the list is the all-seven-tiles bonus, which has a value but no bag
// count — so its bag steppers are omitted rather than drawn dead.
static void dstBingoRow(TFT_eSprite &g, const uint8_t *&track, int y, uint8_t lang) {
  g.fillRect(0, y, SCRW, DST_ROWH, COL_BG);
  g.setTextColor(COL_FG, COL_BG);
  g.setTextDatum(ML_DATUM);
  sprStr(g, track, "BINGO", 12, y + DST_ROWH / 2, 2);

  int by = y + (DST_ROWH - DST_CHIPH) / 2;
  const int xs[2] = { DST_VM, DST_VP };
  for (int k = 0; k < 2; k++) {
    g.fillRoundRect(xs[k], by, DST_CHIPW, DST_CHIPH, 4, COL_ACCENT);
    g.drawRoundRect(xs[k], by, DST_CHIPW, DST_CHIPH, 4, COL_DIM);
    int cx = xs[k] + DST_CHIPW / 2, cy = by + DST_CHIPH / 2;
    g.fillRect(cx - 6, cy - 1, 12, 2, COL_FG);
    if (k & 1) g.fillRect(cx - 1, cy - 6, 2, 12, COL_FG);
  }
  g.setTextDatum(MC_DATUM);
  g.setTextColor(COL_FG, COL_BG);
  sprStr(g, track, String((int)g_dist.bingo(lang)),
         (DST_VM + DST_CHIPW + DST_VP) / 2, y + DST_ROWH / 2, 2);
  g.setTextDatum(ML_DATUM);
  g.setTextColor(COL_DIM, COL_BG);
  sprStr(g, track, "all 7 tiles", DST_BM, y + DST_ROWH / 2, 1);
  g.drawFastHLine(0, y + DST_ROWH - 1, SCRW, theme.edge());
  g.setTextDatum(TL_DATUM);
}

static void dstRow(TFT_eSprite &g, const uint8_t *&track, int y, uint8_t lang, uint8_t i) {
  const TileDef &d = g_dist.at(lang, i);
  g.fillRect(0, y, SCRW, DST_ROWH, COL_BG);

  // Letter. Blanks have no glyph of their own, so show them as "?" like a tile.
  g.setTextColor(COL_FG, COL_BG);
  g.setTextDatum(ML_DATUM);
  sprStr(g, track, d.letter == TILE_BLANK ? String("?") : String((char)d.letter),
         12, y + DST_ROWH / 2, 4);

  int by = y + (DST_ROWH - DST_CHIPH) / 2;
  const int xs[4] = { DST_VM, DST_VP, DST_BM, DST_BP };
  for (int k = 0; k < 4; k++) {
    g.fillRoundRect(xs[k], by, DST_CHIPW, DST_CHIPH, 4, COL_ACCENT);
    g.drawRoundRect(xs[k], by, DST_CHIPW, DST_CHIPH, 4, COL_DIM);
    // "-" on the left of each pair, "+" on the right.
    int cx = xs[k] + DST_CHIPW / 2, cy = by + DST_CHIPH / 2;
    g.fillRect(cx - 6, cy - 1, 12, 2, COL_FG);
    if (k & 1) g.fillRect(cx - 1, cy - 6, 2, 12, COL_FG);
  }

  g.setTextDatum(MC_DATUM);
  g.setTextColor(COL_FG, COL_BG);
  sprStr(g, track, String((int)d.value), (DST_VM + DST_CHIPW + DST_VP) / 2, y + DST_ROWH / 2, 2);
  sprStr(g, track, String((int)d.count), (DST_BM + DST_CHIPW + DST_BP) / 2, y + DST_ROWH / 2, 2);

  g.drawFastHLine(0, y + DST_ROWH - 1, SCRW, theme.edge());
  g.setTextDatum(TL_DATUM);
}

static void letterDistScreen() {
  uint8_t lang = g_lang;
  const int CY = CONTENTY + 22;                       // below the column headings
  const int CH = SCRH - CY - NAVH;
  const uint8_t n = g_dist.count(lang) + 1;   // +1 for the BINGO row at the top
  const int total = n * DST_ROWH;

  TFT_eSprite spr(tft);
  spr.setColorDepth(16);
  bool haveSpr = (spr.createSprite(SCRW, CH) != nullptr);
  const uint8_t *sf = nullptr;

  // Column headings + running tile total. Redrawn only when the total changes.
  auto header = [&]() {
    tft->fillRect(0, CONTENTY, SCRW, 22, COL_BG);
    tft->setTextDatum(ML_DATUM);
    tft->setTextColor(COL_DIM, COL_BG);
    drawStr("VALUE", DST_VM, CONTENTY + 11, 1);
    drawStr("BAG",   DST_BM, CONTENTY + 11, 1);
    uint16_t tot = g_dist.totalTiles(lang);
    tft->setTextDatum(MR_DATUM);
    // Over the engine's bag capacity the extra tiles would simply never be
    // dealt, so flag it rather than silently truncating.
    tft->setTextColor(tot > DIST_MAX_TILES ? TFT_RED : COL_DIM, COL_BG);
    drawStr(String(tot) + " tiles", SCRW - 8, CONTENTY + 11, 1);
    tft->setTextDatum(TL_DATUM);
  };

  float scroll = 0, fling = 0;
  auto render = [&]() {
    float maxS = total > CH ? total - CH : 0;
    if (scroll < 0) scroll = 0;
    if (scroll > maxS) scroll = maxS;
    if (!haveSpr) return;
    sf = nullptr;
    spr.fillSprite(COL_BG);
    for (uint8_t i = 0; i < n; i++) {
      int y = i * DST_ROWH - (int)scroll;
      if (y + DST_ROWH < 0 || y > CH) continue;
      if (i == 0) dstBingoRow(spr, sf, y, lang);
      else        dstRow(spr, sf, y, lang, i - 1);
    }
    sprScrollBar(spr, CH, total, scroll);
    spr.pushSprite(0, CY);
  };

  tft->fillScreen(COL_BG);
  drawHeader(String("Letters: ") + LANG_NAMES[lang], true);
  header();
  drawNav("Back", "Reset", "Done");
  render();

  bool wasDown = false, moved = false;
  uint16_t pX = 0, pY = 0, lastY = 0;
  float pScroll = 0, vel = 0;
  uint32_t lastT = 0, repeatT = 0;
  int heldChip = -1, heldRow = -1;

  auto applyStep = [&](int row, int chip) {
    if (row == 0) {                                  // BINGO row: value only
      int v = (int)g_dist.bingo(lang);
      if (chip == 0) v -= DIST_BINGO_STEP;
      else if (chip == 1) v += DIST_BINGO_STEP;
      else return;                                   // no bag steppers here
      if (v < 0) v = 0;
      g_dist.setBingo(lang, (uint16_t)v);
      render();
      return;
    }
    TileDef &d = g_dist.at(lang, row - 1);
    switch (chip) {
      case 0: if (d.value > 0) d.value--; break;
      case 1: if (d.value < DIST_MAX_VALUE) d.value++; break;
      case 2: if (d.count > 0) d.count--; break;
      case 3: if (d.count < DIST_MAX_COUNT) d.count++; break;
    }
    render();
    header();
  };

