H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t ty = touch->y(), tx = touch->x();
    uint32_t now = millis();

    if (down && !wasDown) {
      pX = tx; pY = ty; pScroll = scroll; moved = false; fling = 0;
      lastY = ty; lastT = now; vel = 0;
      heldChip = -1; heldRow = -1;
      if ((int)ty >= CY && (int)ty < CY + CH) {
        int abs = (int)ty - CY + (int)scroll;
        int row = abs / DST_ROWH;
        int chip = dstChipAt(tx, abs % DST_ROWH);
        if (row >= 0 && row < n && chip >= 0) {
          heldRow = row; heldChip = chip;
          applyStep(row, chip);
          repeatT = now + 450;                 // hold to repeat
        }
      }
    } else if (down && wasDown) {
      if (heldChip >= 0) {
        // Auto-repeat while held, so a count can be walked up quickly.
        if (now > repeatT) { applyStep(heldRow, heldChip); repeatT = now + 90; }
      } else {
        int dy = (int)pY - (int)ty;
        if (abs(dy) > 6) moved = true;
        if (moved) {
          scroll = pScroll + dy;
          uint32_t dt = now - lastT;
          if (dt > 0) { vel = (float)((int)lastY - (int)ty) / (float)dt * 1000.0f; lastY = ty; lastT = now; }
          render();
        }
      }
    } else if (!down && wasDown) {
      if (heldChip >= 0) { heldChip = -1; }
      else if (!moved) {
        if (backTapped(pX, pY)) break;
        int nh = navHit(pX, pY);
        if (nh == 0 || nh == 2) break;         // Back / Done both save
        if (nh == 1) {                         // Reset to the built-in table
          g_dist.reset(lang);
          render();
          header();
        }
      } else {
        fling = vel;
      }
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      render();
    } else {
      fling = 0;
    }

    wasDown = down;
    delay(10);
  }

  if (haveSpr) spr.deleteSprite();
  g_dist.save(lang);
}

// Settings (H4W9 layout: highlight on tap, partial redraw, no flash)
// Theme, Accent, Font Color, Board, Language, Letters, CPU Words, Tile Draw,
// Brightness, LED, WiFi, Debug, About
// (+ Calibrate Touch on resistive panels — capacitive needs no calibration).
#ifdef HAS_CAP_TOUCH
static const int SET_N = 14;
#else
static const int SET_N = 15;
#endif
// Rows 0..9 are chip rows; the value string is needed for hit-testing too.
// Row 5 (Letters) opens a screen, so it is an info row despite sitting here.
static const int SET_CHIP_MAX = 10;
static String setChipVal(int row) {
  switch (row) {
    case 0: return theme.themeName();
    case 1: return theme.accentName();
    case 2: return theme.fontColName();
    case 3: return theme.boardPalName();
    case 4: return LANG_NAMES[g_lang];
    // If the reduced list is switched on but missing from the card the CPU
    // silently plays from the full one — which looks exactly like the setting
    // not working. Say so instead.
    case 6: if (!g_cpuCommon) return "Full";
            return (g_dawg.loaded() && !g_dawgCpu.loaded()) ? "No list!" : "Human-like";
    case 7: return g_luckHelper ? "Balanced" : "Pure random";
    case 8: return (g_crossLimit == 1) ? String("1 (tidy)") : String(g_crossLimit);
    case 9: return String(theme.bright + 1) + "/20";
    case 10: return String(theme.led_bright) + "/20";
  }
  return "";
}
// Draw one settings row at its slot, highlighted if `sel`. No fillScreen.
static void drawSettingRow(int row, int sel, int y) {
  bool s = (row == sel);
  switch (row) {
    case 0: drawChipRow(y, "Theme",      setChipVal(0), false, s, 0); break;
    case 1: drawChipRow(y, "Accent",     setChipVal(1), false, s, 0); break;
    case 2: drawChipRow(y, "Font Color", setChipVal(2), false, s, theme.fontColPreview()); break;
    case 3: drawChipRow(y, "Board",      setChipVal(3), false, s, 0); break;
    case 4: drawChipRow(y, "Language",   setChipVal(4), false, s, 0); break;
    case 5: drawInfoRow(y, "Letters",    g_dist.edited(g_lang) ? String("edited") : String(""), s); break;
    case 6: drawChipRow(y, "CPU Words",  setChipVal(6), false, s, 0); break;
    case 7: drawChipRow(y, "Tile Draw",  setChipVal(7), false, s, 0); break;
    case 8: drawChipRow(y, "Cross Words", setChipVal(8), true, s, 0); break;
    case 9: drawChipRow(y, "Brightness", setChipVal(9), true,  s, 0); break;
    case 10: drawChipRow(y, "LED",       setChipVal(10), true, s, 0); break;
    case 11: drawInfoRow(y, "WiFi Setup", WiFi.status() == WL_CONNECTED ? WiFi.SSID() : String(""), s); break;
    case 12: drawInfoRow(y, "WiFi Debug", "", s); break;
    case 13: drawInfoRow(y, "About",     "", s); break;
#ifndef HAS_CAP_TOUCH
    case 14: drawInfoRow(y, "Calibrate Touch", "", s); break;
#endif
  }
}

// Sprite twin of drawSettingRow. Kept alongside rather than merged: the two
// renderers cannot share code because TFT_eSprite does not override the drawing
// primitives virtually.
static void sprSettingRow(TFT_eSprite &spr, const uint8_t *&sf, int row, int sel, int y) {
  bool s = (row == sel);
  switch (row) {
    case 0: sprChipRow(spr, sf, y, "Theme",      setChipVal(0), false, s, 0); break;
    case 1: sprChipRow(spr, sf, y, "Accent",     setChipVal(1), false, s, 0); break;
    case 2: sprChipRow(spr, sf, y, "Font Color", setChipVal(2), false, s, theme.fontColPreview()); break;
    case 3: sprChipRow(spr, sf, y, "Board",      setChipVal(3), false, s, 0); break;
    case 4: sprChipRow(spr, sf, y, "Language",   setChipVal(4), false, s, 0); break;
    case 5: sprInfoRow(spr, sf, y, "Letters",    g_dist.edited(g_lang) ? String("edited") : String(""), s); break;
    case 6: sprChipRow(spr, sf, y, "CPU Words",  setChipVal(6), false, s, 0); break;
    case 7: sprChipRow(spr, sf, y, "Tile Draw",  setChipVal(7), false, s, 0); break;
    case 8: sprChipRow(spr, sf, y, "Cross Words", setChipVal(8), true, s, 0); break;
    case 9: sprChipRow(spr, sf, y, "Brightness", setChipVal(9), true,  s, 0); break;
    case 10: sprChipRow(spr, sf, y, "LED",       setChipVal(10), true, s, 0); break;
    case 11: sprInfoRow(spr, sf, y, "WiFi Setup", WiFi.status() == WL_CONNECTED ? WiFi.SSID() : String(""), s); break;
    case 12: sprInfoRow(spr, sf, y, "WiFi Debug", "", s); break;
    case 13: sprInfoRow(spr, sf, y, "About",     "", s); break;
#ifndef HAS_CAP_TOUCH
    case 14: sprInfoRow(spr, sf, y, "Calibrate Touch", "", s); break;
#endif
  }
}

