H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
// About — app name/version/author, hardware + build detail rows, credits.
static void aboutScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("About", true);

#ifdef MARAUDER_V8
  const int dName = 26, dSub = 17, dAuth = 18, dRule = 6, dRow = 17, dGap = 2, dRule2 = 6, dCred = 16;
  const int valX = 82;
  const char *credit1 = "Word lists from dict.cc";
  const char *credit2 = "+ Wiktionary via Kaikki";
#else
  const int dName = 32, dSub = 22, dAuth = 24, dRule = 10, dRow = 21, dGap = 4, dRule2 = 8, dCred = 20;
  const int valX = 110;
  const char *credit1 = "Word lists from dict.cc + Wiktionary";
  const char *credit2 = "Classic 15x15 board";
#endif

  int cx = SCRW / 2, y = CONTENTY + 12;

  tft->setTextColor(COL_FG, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr(FW_NAME, cx, y, 4); y += dName;
  drawStr(String("Version ") + FW_VERSION, cx, y, 2); y += dSub;
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("UI by " FW_AUTHOR, cx, y, 2); y += dAuth;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(1, theme.edge())); y += dRule;

  tft->setTextDatum(TL_DATUM);
  auto row = [&](const char *label, const String &value) {
    tft->setTextColor(COL_DIM, COL_BG); drawStr(label, 16, y, 2);
    tft->setTextColor(COL_FG, COL_BG);  drawStr(value, valX, y, 2);
    y += dRow;
  };
  row("Board",   BOARD_NAME);
  row("MCU",     BOARD_MCU);
  row("Display", BOARD_DISPLAY);
  row("Touch",   BOARD_TOUCH);
  {
    size_t ps = ESP.getPsramSize();
    if (ps >= 1024 * 1024)  row("PSRAM", String((unsigned)((ps + 512 * 1024) / (1024 * 1024))) + " MB");
    else if (ps > 0)        row("PSRAM", String((unsigned)(ps / 1024)) + " KB");
    else                    row("PSRAM", "None");
  }
  row("Words",   g_dawg.loaded() ? String(g_dawg.wordCount()) : String("not loaded"));
  row("Built",   __DATE__);
  row("Commit",  FW_COMMIT);

  y += dGap;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(2, theme.edge())); y += dRule2;
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr(credit1, 16, y, 2); y += dCred;
  drawStr(credit2, 16, y, 2);

  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

// Settings.
//
// The list scrolls, composited into a sprite like every other long list here.
// It has to: the row count grew past a screenful on the Pancake and was well
// past one on the V8, and redrawing rows straight to the panel mid-drag is the
// flashing this firmware avoids. The scrollbar is drawn INSIDE the sprite by
// sprScrollBar, so it moves with the content in the same push and never
// strobes on its own.
static void settingsFlow() {
  int sel = -1;
  const int CY = CONTENTY;
  const int CH = SCRH - CONTENTY;
  const int total = SET_N * ITEMH;

  TFT_eSprite spr(tft);
  spr.setColorDepth(16);
  bool haveSpr = (spr.createSprite(SCRW, CH) != nullptr);
  const uint8_t *sf = nullptr;

  float scroll = 0, fling = 0;

  auto render = [&]() {
    float maxS = total > CH ? total - CH : 0;
    if (scroll < 0) scroll = 0;
    if (scroll > maxS) scroll = maxS;
    if (!haveSpr) {
      // No room for the sprite (a V8 without PSRAM): draw straight to the
      // panel. Scrolling still works, it just is not flicker-free. The viewport
      // clips it to the content area so a row scrolled half off the top cannot
      // paint over the header.
      tft->setViewport(0, CY, SCRW, CH);
      tft->fillRect(0, 0, SCRW, CH, COL_BG);
      for (int i = 0; i < SET_N; i++) {
        int y = i * ITEMH - (int)scroll;
        if (y + ITEMH < 0 || y > CH) continue;
        drawSettingRow(i, sel, y);
      }
      tft->resetViewport();
      return;
    }
    sf = nullptr;
    spr.fillSprite(COL_BG);
    for (int i = 0; i < SET_N; i++) {
      int y = i * ITEMH - (int)scroll;
      if (y + ITEMH < 0 || y > CH) continue;
      sprSettingRow(spr, sf, i, sel, y);
    }
    sprScrollBar(spr, CH, total, scroll);
    spr.pushSprite(0, CY);
  };

  auto full = [&]() {                         // full repaint (theme/bg changed)
    tft->fillScreen(COL_BG);
    drawHeader("Settings", true);
    render();
  };
  auto recolor = [&]() {                      // font colour changed — no fillScreen
    drawHeader("Settings", true);
    render();
  };
  full();

  bool wasDown = false, moved = false;
  uint16_t pX = 0, pY = 0, lastY = 0;
  float pScroll = 0, vel = 0;
  uint32_t lastT = 0;

  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t tx = touch->x(), ty = touch->y();
    uint32_t now = millis();

    if (down && !wasDown) {
      pX = tx; pY = ty; pScroll = scroll; moved = false; fling = 0;
      lastY = ty; lastT = now; vel = 0;
    } else if (down && wasDown) {
      int dy = (int)pY - (int)ty;
      if (abs(dy) > 6) moved = true;
      if (moved) {
        scroll = pScroll + dy;
        uint32_t dt = now - lastT;
        if (dt > 0) { vel = (float)((int)lastY - (int)ty) / (float)dt * 1000.0f; lastY = ty; lastT = now; }
        render();
      }
    } else if (!down && wasDown) {
      if (moved) { fling = vel; wasDown = down; delay(10); continue; }

      if (backTapped(pX, pY)) { if (haveSpr) spr.deleteSprite(); ledOff(); return; }
      if ((int)pY < CY) { wasDown = down; delay(10); continue; }

      // Screen y -> list row, through the scroll offset.
      int absY = (int)pY - CY + (int)scroll;
      int row = absY / ITEMH;
      if (row < 0 || row >= SET_N) { wasDown = down; delay(10); continue; }

      int old = sel; sel = row;
      if (old != row) render();
      if (row != 10) ledOff();                    // LED preview only on the LED row

      // Chip hit-testing works in the row's own space, so it is independent of
      // where the row currently sits on screen.
      int rowTop = CY + row * ITEMH - (int)scroll;
      int h = (row <= SET_CHIP_MAX) ? chipHit(rowTop, setChipVal(row), pX, pY) : -1;

      switch (row) {
        case 0: if (h >= 0) { theme.cycleTheme(h); theme.save(); applyThemeToViewManager(); full(); } break;
        case 1: if (h >= 0) { theme.cycleAccent(h); theme.save(); applyThemeToViewManager(); render(); } break;
        case 2: if (h >= 0) { theme.cycleFontCol(h); theme.save(); applyThemeToViewManager(); recolor(); } break;
        case 3: if (h >= 0) { theme.cycleBoardPal(h); theme.save(); render(); } break;
        // Changing language invalidates the loaded word list — drop it so the next
        // Dictionary/New Game load picks up the other .dwg.
        case 4: if (h >= 0) { g_lang = (g_lang == LANG_DE) ? LANG_EN : LANG_DE;
                              cfgSave(); g_dawg.unload(); g_dawgCpu.unload(); render(); } break;
        case 5: letterDistScreen(); full(); break;
        // Reduced vocabulary for the CPU. Loaded lazily, so just flip the flag.
        case 6: if (h >= 0) { g_cpuCommon = !g_cpuCommon; cfgSave(); render(); } break;
        // Balanced draws: see Game::shuffleBag/refill.
        // Applied by newGame()/loadGame() — it changes how the bag is built, so it
        // takes effect from the next game rather than mid-hand.
        case 7: if (h >= 0) { g_luckHelper = !g_luckHelper; cfgSave(); render(); } break;
        // How many parallel words one play may form. 1 keeps the board a
        // crossword; raising it allows the dense side-by-side plays that make a
        // board sloppy, so it stays opt-in. Takes effect on the next new game.
        case 8: if (h == 0 && g_crossLimit > 1) g_crossLimit--;
                else if (h == 1 && g_crossLimit < 5) g_crossLimit++;
                if (h >= 0) { cfgSave(); render(); } break;
        case 9: if (h == 0 && theme.bright > 0)  theme.bright--;
                else if (h == 1 && theme.bright < 19) theme.bright++;
                if (h >= 0) { theme.save(); applyBrightness(); render(); } break;
        case 10: if (h == 0 && theme.led_bright > 0)  theme.led_bright--;
                 else if (h == 1 && theme.led_bright < 20) theme.led_bright++;
                 if (h >= 0) { theme.save(); render(); }
                 ledWifi(); break;                // live preview at the new brightness
        case 11: wifiSetup(); full(); break;
        case 12: wifiDebug(); full(); break;
        case 13: aboutScreen(); full(); break;
#ifndef HAS_CAP_TOUCH
        case 14: touchCalRun(); full(); break;    // resistive drifts — allow a redo
#endif
        default: break;
      }
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      render();
    } else {
      fling = 0;
    }

