H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
    wasDown = down;
    delay(10);
  }
}

// ═════════════════════════════════════════════════════════════════════════════
//  Game view — PORTRAIT.
//
//  EVERYTHING is composited into off-screen sprites and pushed in one go. No
//  part of this screen ever draws straight to the panel, because any direct
//  fill/redraw is visible as a flash. Two sprites rather than one full-screen
//  buffer so that panning the board doesn't have to re-push the rack, and
//  touching the rack doesn't have to re-push the board:
//
//    g_bs  board viewport   320 x 315   (~200 KB, PSRAM)
//    g_ls  hint+rack+score  320 x  82   (~52 KB)
//
//  The header and banner are painted once per turn and left alone.
//
//  Board zoom: tapping an empty square toggles a ~1.9x zoom centred on it, and
//  while zoomed a drag pans. Unzoomed, all 15 columns fit in 21 px cells; zoomed
//  they are 40 px and about 8 columns are visible.
//
//    header  28   shell header: back chevron, turn, status corner
//    banner  20   "CPU played HOE and scored 12 points"
//    board  315   viewport onto a 315 px (fit) or 600 px (zoomed) board
//    hint    18   live word + score, or word-hint chips
//    rack    44   7 tiles
//    score   18   You / opponent / bag
//    nav     28   shell footer, contextual
// ═════════════════════════════════════════════════════════════════════════════
static Game g_game;
static bool g_gameActive = false;          // a game exists (Continue is meaningful)

// Pancake's edge-to-edge board (21 px cells) leaves the chrome below it room
// to spare on its 480 px screen. The same edge-to-edge sizing on V8's 320 px
// screen (15 px cells, full-size chrome) ran the score line about 30 px off
// the bottom. V8 gets a deliberately smaller, letterboxed board and a
// compressed strip so the whole thing clears the nav bar -- and every px the
// banner/hint/rack/gaps give up below goes straight to the board, since that's
// the one thing on this screen players actually want bigger. G_UIFONT drops
// the lower strip's text to the 10px VLW font to match its shorter rows (the
// 14px font used on Pancake would clip in a row this short).
#ifdef MARAUDER_V8
static const int G_CELL  = 13;                     // letterboxed, not edge-to-edge
static const int G_BANH  = 11;
static const int G_HINTH = 13;                     // sized for G_UIFONT, not the 14px font
static const int G_RT    = 23;                     // smaller than the touch-safe ITEMH row;
                                                    // this is a drag target, not a tap target
static const int G_GAP   = 1;
static const uint8_t G_UIFONT = 1;                 // 10px VLW font
#else
static const int G_CELL  = (SCRW - 4) / BOARD_N;   // fit-to-width cell (21 on Pancake)
static const int G_BANH  = 20;
static const int G_HINTH = 18;
static const int G_RT    = (SCRW - 8) / RACK_N;    // rack tile size
static const int G_GAP   = 2;
static const uint8_t G_UIFONT = 2;                 // 14px VLW font
#endif
static const int G_CELLZ = G_CELL * 19 / 10;       // zoomed cell (~1.9x)
static const int G_BSZ   = G_CELL * BOARD_N;       // viewport height = fitted board
static const int G_BANY  = HDRH;
static const int G_BY    = G_BANY + G_BANH + G_GAP;    // board viewport top
static const int G_LSY   = G_BY + G_BSZ + G_GAP;       // lower strip top
static const int G_LSH   = G_HINTH + G_RT + G_HINTH + 4;
static const int G_RACKX = (SCRW - RACK_N * G_RT) / 2;

// Sprite framebuffers. Null if PSRAM was unavailable — see gSpritesBegin().
static TFT_eSprite *g_bs = nullptr;
static TFT_eSprite *g_ls = nullptr;
static const uint8_t *g_bsFont = nullptr;
static const uint8_t *g_lsFont = nullptr;

static int  g_selRack = -1;                // rack slot picked up by tapping
static String g_banner;
static uint16_t g_bannerCol = 0;

// Zoom / pan state. Pan is in board pixels, always clamped by gClampPan().
static bool g_zoom  = false;
static int  g_panX  = 0, g_panY = 0;

// Drag state. g_dragRack >= 0 means a rack tile is riding the finger.
static int  g_dragRack = -1;
static int  g_dragX = 0, g_dragY = 0;      // finger, in screen coords
static int  g_dragSlot = -1;               // tray slot the drag is hovering, -1 = none
static bool g_dragFromBoard = false;       // the drag started by lifting a placed tile
// A swipe that began on a committed tile: it looks a word up instead of panning.
static bool    g_swipeFrom = false;
static uint8_t g_swipeR = 0, g_swipeC = 0;

static inline int gCell()    { return g_zoom ? G_CELLZ : G_CELL; }
static inline int gBoardPx() { return gCell() * BOARD_N; }
// Board origin inside the viewport sprite: centred when it fits, else -pan.
static inline int gOffX() { int b = gBoardPx(); return (b <= SCRW)  ? (SCRW - b) / 2  : -g_panX; }
static inline int gOffY() { int b = gBoardPx(); return (b <= G_BSZ) ? (G_BSZ - b) / 2 : -g_panY; }

static void gClampPan() {
  int b = gBoardPx();
  int mx = b - SCRW,  my = b - G_BSZ;
  if (mx < 0) mx = 0;
  if (my < 0) my = 0;
  if (g_panX < 0) g_panX = 0;
  if (g_panY < 0) g_panY = 0;
  if (g_panX > mx) g_panX = mx;
  if (g_panY > my) g_panY = my;
}
// Centre the viewport on a board cell (used when zooming in on a tap).
static void gCentreOn(int row, int col) {
  g_panX = col * gCell() + gCell() / 2 - SCRW / 2;
  g_panY = row * gCell() + gCell() / 2 - G_BSZ / 2;
  gClampPan();
}

static int rackSlotX(int i) { return G_RACKX + i * G_RT; }

// Whose tiles the tray displays. NOT necessarily whose turn it is: while the CPU
// is playing, the tray must keep showing the human's rack rather than swapping to
// the opponent's letters (which also gave away its hand). Interaction always
// happens on a human turn, where this and current() are the same player.
static uint8_t g_viewPlayer = 0;
static void updateViewPlayer() {
  if (!g_game.player(g_game.current()).isCpu) g_viewPlayer = g_game.current();
}
static inline const uint8_t *viewRack() { return g_game.player(g_viewPlayer).rack; }

// Words spelled by CONSECUTIVE tiles in the tray, shown above the rack
// ("vid id ma" from a C V I D N M A rack: V-I-D, I-D and M-A are each an adjacent
// run). Rearranging the tray changes them, which is the point — they reward
// lining letters up.
#define HINT_MAX 5
static String g_hint[HINT_MAX];
static uint8_t g_hintN = 0;

static void buildTrayHints() {
  g_hintN = 0;
  const Dawg &d = cpuDict();
  if (!d.loaded()) return;
  const uint8_t *rack = viewRack();

  for (uint8_t a = 0; a < RACK_N && g_hintN < HINT_MAX; a++) {
    uint8_t w[RACK_N], n = 0;
    for (uint8_t b = a; b < RACK_N; b++) {
      uint8_t t = rack[b];
      // A blank has no letter of its own and a tile on the board is not in the
      // tray, so either one ends the run.
      if (t == TILE_EMPTY || t == TILE_BLANK) break;
      bool onBoard = false;
      for (uint8_t k = 0; k < g_game.pendingCount(); k++)
        if (g_game.pending()[k].rackIdx == b) onBoard = true;
      if (onBoard) break;
      w[n++] = t;
      if (n < 2) continue;
      if (!d.contains(w, n)) continue;
      String s;
      for (uint8_t i = 0; i < n; i++) s += (char)w[i];
      bool dupe = false;
      for (uint8_t i = 0; i < g_hintN; i++) if (g_hint[i] == s) dupe = true;
      if (!dupe && g_hintN < HINT_MAX) g_hint[g_hintN++] = s;
    }
  }
}

