H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
// Which tray slot a point corresponds to, or -1 if it isn't over the tray. Used
// both for the live "tiles move aside" preview and for the actual drop, so the
// gap you see is always the slot you get.
static int raySlotAt(int x, int y) {
  int ry = G_LSY + G_HINTH + 2;
  if (y < ry - 10 || y >= ry + G_RT + 10) return -1;
  int slot = (x - G_RACKX + G_RT / 2) / G_RT;
  if (slot < 0) slot = 0;
  if (slot > RACK_N - 1) slot = RACK_N - 1;
  return slot;
}

// A tile's glyph is just its letter byte: the VLW fonts carry real Ä Ö Ü ß, and
// the smooth-font wrappers map the private codes to them.
static inline String tileGlyph(uint8_t letter) { return String((char)letter); }

static bool pendingIsBlankAt(uint8_t r, uint8_t c) {
  for (uint8_t i = 0; i < g_game.pendingCount(); i++)
    if (g_game.pending()[i].row == r && g_game.pending()[i].col == c)
      return g_game.pending()[i].isBlank;
  return false;
}

// Draw one tile face at an arbitrary position, into any sprite. Shared by the
// board, the rack and the tile being dragged, so they can never drift apart.
static void gTile(TFT_eSprite &g, const uint8_t *&track, int x, int y, int sz,
                  uint8_t letter, bool blank, uint16_t face, uint16_t edge,
                  uint16_t textc, uint16_t valc, uint8_t value) {
  int rad = sz >= 30 ? 4 : 2;
  g.fillRoundRect(x, y, sz - 1, sz - 1, rad, face);
  g.drawRoundRect(x, y, sz - 1, sz - 1, rad, edge);
  g.setTextColor(textc, face);
  g.setTextDatum(MC_DATUM);
  if (letter == TILE_BLANK) {
    sprStr(g, track, "?", x + sz / 2, y + sz / 2, sz >= 30 ? 4 : 2);
  } else {
    sprStr(g, track, tileGlyph(letter), x + sz / 2 - 1, y + sz / 2, sz >= 30 ? 4 : 2);
    if (!blank) {
      g.setTextDatum(BR_DATUM);
      g.setTextColor(valc, face);
      sprStr(g, track, String((int)value), x + sz - 3, y + sz - 2, 1);
    }
  }
  g.setTextDatum(TL_DATUM);
}

// Board viewport. Only the cells that intersect the viewport are drawn, so the
// cost is the same zoomed or not. Coordinates are sprite-relative; the sprite is
// pushed at G_BY.
static void gPaintBoard(TFT_eSprite &g, const uint8_t *&track) {
  BoardPal P = theme.board();
  const int cs = gCell(), ox = gOffX(), oy = gOffY();
  int c0 = ox >= 0 ? 0 : (-ox) / cs;
  int r0 = oy >= 0 ? 0 : (-oy) / cs;
  int c1 = c0 + SCRW / cs + 2;  if (c1 > BOARD_N) c1 = BOARD_N;
  int r1 = r0 + G_BSZ / cs + 2; if (r1 > BOARD_N) r1 = BOARD_N;

  for (int r = r0; r < r1; r++) {
    for (int c = c0; c < c1; c++) {
      int x = ox + c * cs, y = oy + r * cs;
      uint8_t letter = g_game.shownAt(r, c);
      if (letter == TILE_EMPTY) {
        Premium p = premiumAt(r, c);
        uint16_t fill = p == PR_DL ? P.dl : p == PR_TL ? P.tl
                      : p == PR_DW ? P.dw : p == PR_TW ? P.tw
                      : p == PR_CENTRE ? P.dw : P.empty;
        g.fillRoundRect(x, y, cs - 1, cs - 1, 2, fill);
        const char *lbl = p == PR_DL ? "DL" : p == PR_TL ? "TL"
                        : p == PR_DW ? "DW" : p == PR_TW ? "TW" : nullptr;
        // Only label a cell that is FULLY on screen. A part-visible cell at the
        // viewport edge clips the glyphs mid-height, and a clipped "L" loses its
        // foot and reads as "I" — which is where the stray "TI"/"DI" came from.
        bool whole = (x >= 0 && y >= 0 && x + cs <= SCRW && y + cs <= G_BSZ);
        if (lbl && whole) {
          g.setTextColor(P.prem_text, fill);
          g.setTextDatum(MC_DATUM);
          sprStr(g, track, lbl, x + cs / 2, y + cs / 2, cs >= 30 ? 2 : 1);
        } else if (p == PR_CENTRE) {
          g.fillCircle(x + cs / 2, y + cs / 2, cs / 6, P.prem_text);
        }
        g.setTextDatum(TL_DATUM);
      } else {
        bool pend = g_game.isPendingAt(r, c);
        uint16_t face = pend ? P.tile_hold
                      : g_game.wasLastMove(r, c) ? P.tile_last : P.tile;
        bool blank = pend ? pendingIsBlankAt(r, c) : g_game.isBlankAt(r, c);
        gTile(g, track, x, y, cs, letter, blank, face, P.tile_edge,
              P.tile_text, P.tile_val, g_game.letterValue(letter));
      }
    }
  }

  // A rack tile riding the finger is drawn last so it floats above the board.
  if (g_dragRack >= 0) {
    uint8_t t = viewRack()[g_dragRack];
    int sz = gCell() < G_RT ? G_RT : gCell();
    int x = g_dragX - sz / 2, y = g_dragY - G_BY - sz / 2 - 10;   // lift above the fingertip
    gTile(g, track, x, y, sz, t, false, P.tile_last, COL_SEL,
          P.tile_text, P.tile_val, g_game.letterValue(t));
  }
}

// Composite the board: into the sprite when we have it (no flicker), else
// straight to the panel (flickers, but the game still plays without PSRAM).
static void gRenderBoard() {
  if (!g_bs) return;
  g_bsFont = nullptr;
  g_bs->fillSprite(theme.board().gutter);
  gPaintBoard(*g_bs, g_bsFont);
  g_bs->pushSprite(0, G_BY);
}

// Lower strip: hint line, rack, score line.
static void gPaintLower(TFT_eSprite &g, const uint8_t *&track) {
  BoardPal P = theme.board();

  // Hint line: while placing it reports the word and score (Word Check);
  // otherwise it shows the words the tray currently spells.
  if (!g_game.pendingCount() && g_hintN) {
    int wsum = 0;
    for (uint8_t i = 0; i < g_hintN; i++) wsum += strWidth(g_hint[i], 1) + 14;
    int x = (SCRW - wsum) / 2;
    if (x < 2) x = 2;
    for (uint8_t i = 0; i < g_hintN; i++) {
      int cw = strWidth(g_hint[i], 1) + 10;
      g.fillRoundRect(x, 1, cw, G_HINTH - 3, 4, theme.edge());
      g.setTextColor(COL_FG, theme.edge());   // same as the footer buttons
      g.setTextDatum(MC_DATUM);
      sprStr(g, track, g_hint[i], x + cw / 2, G_HINTH / 2, 1);
      x += cw + 4;
    }
    g.setTextDatum(TL_DATUM);
  }
  if (g_game.pendingCount()) {
    String words;
    MoveErr e = g_game.validate();
    g.setTextDatum(MC_DATUM);
    if (e == MV_OK) {
      int sc = g_game.scorePending(&words);
      g.setTextColor(COL_OK, COL_BG);
      sprStr(g, track, words + "  +" + sc, SCRW / 2, G_HINTH / 2, G_UIFONT);
    } else {
      g.setTextColor(COL_DIM, COL_BG);
      sprStr(g, track, e == MV_BAD_WORD ? "not a word" : "incomplete",
             SCRW / 2, G_HINTH / 2, G_UIFONT);
    }
    g.setTextDatum(TL_DATUM);
  }

  // Rack. While a tile is being dragged over the tray the others shuffle along
  // to open a gap where it would land, so the drop position is visible before
  // letting go.
  int ry = G_HINTH + 2;
  int order[RACK_N], nord = 0;
  for (int i = 0; i < RACK_N; i++) {
    if (i == g_dragRack) continue;                 // the dragged tile is on the finger
    bool onBoard = false;
    for (uint8_t k = 0; k < g_game.pendingCount(); k++)
      if (g_game.pending()[k].rackIdx == i) onBoard = true;
    order[nord++] = (viewRack()[i] == TILE_EMPTY || onBoard)
                      ? -1 : i;                    // -1 renders as an empty slot
  }
  bool gapping = (g_dragRack >= 0 && g_dragSlot >= 0);
  int k = 0;
  for (int slot = 0; slot < RACK_N; slot++) {
    int x = rackSlotX(slot);
    int src = -1;
    if (gapping) {
      // Hovering the tray: close up the ranks and leave a gap at the target.
      if (slot != g_dragSlot && k < nord) src = order[k++];
    } else {
      // Not over the tray (idle, or dragging out over the board): tiles stay put
      // and the source slot simply reads empty.
      src = (slot == g_dragRack) ? -1 : slot;
    }
    if (src < 0 || viewRack()[src] == TILE_EMPTY) {
      g.drawRoundRect(x + 2, ry + 2, G_RT - 4, G_RT - 4, 4, theme.edge());
      continue;
    }
    bool onBoard = false;
    for (uint8_t kk = 0; kk < g_game.pendingCount(); kk++)
      if (g_game.pending()[kk].rackIdx == src) onBoard = true;
    if (onBoard) {
      g.drawRoundRect(x + 2, ry + 2, G_RT - 4, G_RT - 4, 4, theme.edge());
      continue;
    }
    uint8_t t = viewRack()[src];
    uint16_t face = (src == g_selRack) ? P.tile_last : P.tile;
    uint16_t edge = (src == g_selRack) ? COL_SEL : P.tile_edge;
    gTile(g, track, x + 1, ry + 1, G_RT - 1, t, false, face, edge,
          P.tile_text, P.tile_val, g_game.letterValue(t));
  }

  // Score line.
  int sy = ry + G_RT + 2;
  g.setTextDatum(ML_DATUM);
  int x = 6;
  for (uint8_t p = 0; p < g_game.numPlayers(); p++) {
    bool cur = (p == g_game.current());
    g.setTextColor(cur ? COL_OK : COL_DIM, COL_BG);
    String s = String(g_game.player(p).name) + " " + g_game.player(p).score;
    sprStr(g, track, s, x, sy + G_HINTH / 2, G_UIFONT);
    x += strWidth(s, G_UIFONT) + 10;
  }
  g.setTextColor(COL_DIM, COL_BG);
  g.setTextDatum(MR_DATUM);
  sprStr(g, track, String("Bag ") + g_game.bagCount(), SCRW - 6, sy + G_HINTH / 2, G_UIFONT);
  g.setTextDatum(TL_DATUM);


  // The tile being dragged is painted into this sprite as well as the board's,
  // so it stays visible (and on top) once the finger moves over the tray.
  if (g_dragRack >= 0) {
    uint8_t t = viewRack()[g_dragRack];
    int sz = gCell() < G_RT ? G_RT : gCell();
    gTile(g, track, g_dragX - sz / 2, g_dragY - G_LSY - sz / 2 - 10, sz,
          t, false, P.tile_last, COL_SEL, P.tile_text, P.tile_val,
          g_game.letterValue(t));
  }
}

// Composite the lower strip, sprite or direct (see gRenderBoard).
static void gRenderLower() {
  if (!g_ls) return;
  updateViewPlayer();
  buildTrayHints();          // tray contents drive the chips, so refresh here
  g_lsFont = nullptr;
  g_ls->fillSprite(COL_BG);
  gPaintLower(*g_ls, g_lsFont);
  g_ls->pushSprite(0, G_LSY);
}

// Header + banner. Painted only when the turn or the message changes, so they
// contribute no flicker during play.
static void gRenderTop() {
  // "You" needs "Your turn", not "You's turn".
  {
    String who = g_game.player(g_game.current()).name;
    drawHeader(who == "You" ? String("Your turn") : who + "'s turn", true);
  }
  uint16_t bg = g_banner.length() ? (g_bannerCol ? g_bannerCol : COL_SEL) : COL_BG;
  tft->fillRect(0, G_BANY, SCRW, G_BANH, bg);
  if (g_banner.length()) {
    tft->setTextColor(contrastOn(bg), bg);
    tft->setTextDatum(MC_DATUM);
    drawStr(g_banner, SCRW / 2, G_BANY + G_BANH / 2, G_UIFONT);
    tft->setTextDatum(TL_DATUM);
  }
}

