H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
// Contextual footer, using the shell's own nav bar — it swaps when tiles are
// down.
//   tiles placed  ->  [Recall][Master][Play]
//   rack idle     ->  [Skip] [Master][Shuffle]
static void gRenderNav() {
  if (g_game.pendingCount()) drawNav("Master", "Recall", "Play");
  else                       drawNav("Master", "Shuffle", "Swap/Skip");
}

static void gRenderAll() {
  gRenderTop();
  gRenderBoard();
  gRenderLower();
  gRenderNav();
}

// Allocate the framebuffers. They live in PSRAM; without it we fall back to
// direct drawing, which flickers but still plays.
static bool gSpritesBegin() {
  g_bs = new TFT_eSprite(tft);
  g_bs->setColorDepth(16);
  if (!g_bs->createSprite(SCRW, G_BSZ)) { delete g_bs; g_bs = nullptr; }
  g_ls = new TFT_eSprite(tft);
  g_ls->setColorDepth(16);
  if (!g_ls->createSprite(SCRW, G_LSH)) { delete g_ls; g_ls = nullptr; }
  return g_bs && g_ls;
}
static void gSpritesEnd() {
  if (g_bs) { g_bs->deleteSprite(); delete g_bs; g_bs = nullptr; }
  if (g_ls) { g_ls->deleteSprite(); delete g_ls; g_ls = nullptr; }
}

// Screen point -> board cell. Returns false if the point misses the board.
static bool gCellAt(int sx, int sy, uint8_t &row, uint8_t &col) {
  if (sy < G_BY || sy >= G_BY + G_BSZ) return false;
  int bx = sx - gOffX(), by = (sy - G_BY) - gOffY();
  if (bx < 0 || by < 0) return false;
  int c = bx / gCell(), r = by / gCell();
  if (c < 0 || c >= BOARD_N || r < 0 || r >= BOARD_N) return false;
  row = (uint8_t)r; col = (uint8_t)c;
  return true;
}

// Ask which letter a blank should stand for.
static uint8_t blankPicker() {
  static const uint8_t DE_EXTRA[3] = { 0x80, 0x82, 0x84 };
  int n = 26 + (g_game.lang() == LANG_DE ? 3 : 0);
  const int cols = 5, cw = SCRW / cols, chh = 44;
  int y0 = CONTENTY + 30;

  tft->fillScreen(COL_BG);
  drawHeader("Blank", true);
  tft->setTextColor(COL_FG, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr("Blank stands for:", SCRW / 2, CONTENTY + 14, 2);
  for (int i = 0; i < n; i++) {
    int x = (i % cols) * cw, y = y0 + (i / cols) * chh;
    uint8_t l = (i < 26) ? (uint8_t)('A' + i) : DE_EXTRA[i - 26];
    tft->fillRoundRect(x + 3, y + 3, cw - 6, chh - 6, 4, COL_ACCENT);
    tft->setTextColor(COL_FG, COL_ACCENT);
    drawStr(tileGlyph(l), x + cw / 2, y + chh / 2, 4);
  }
  tft->setTextDatum(TL_DATUM);

  for (;;) {
    uint16_t x, y;
    if (!waitTap(x, y)) continue;
    if (backTapped(x, y)) return 0;
    if ((int)y < y0) continue;
    int col = x / cw, row = ((int)y - y0) / chh;
    int i = row * cols + col;
    if (i >= 0 && i < n) return (i < 26) ? (uint8_t)('A' + i) : DE_EXTRA[i - 26];
  }
}

// Place a rack tile, prompting for the letter if it is a blank. Returns true if
// the tile ended up on the board.
static bool gPlaceFrom(int rackIdx, uint8_t r, uint8_t c) {
  if (rackIdx < 0 || !g_game.isEmpty(r, c)) return false;
  uint8_t declared = 0;
  if (g_game.player(g_game.current()).rack[rackIdx] == TILE_BLANK) {
    declared = blankPicker();
    tft->fillScreen(COL_BG);
    gRenderAll();
    if (!declared) return false;
  }
  return g_game.place(r, c, rackIdx, declared);
}

// scorePending() reports EVERY word a move forms ("HOE, THE, OX"). The banner
// names the move, so it wants only the primary one — the first listed, which is
// the word along the axis of play.
static String mainWord(const String &words) {
  int comma = words.indexOf(", ");
  return comma < 0 ? words : words.substring(0, comma);
}

// Swap / Skip — one dialog for both: pick the tiles to change, or pick none and
// just skip the turn. Returns true if the turn was used (either way), false if
// cancelled.
//
// Drawn ONCE, then only the tile that changed and the footer label are
// repainted. Redrawing the whole screen per tap is what made this flash.
static bool swapSkipDialog() {
  bool sel[RACK_N] = { false };
  // 7 tiles at Pancake's 40px/4px sizing add up to 304px -- wider than V8's
  // 240px screen, which is what ran this off both sides there.
#ifdef MARAUDER_V8
  const int tw = 30, gap = 3;
#else
  const int tw = 40, gap = 4;
#endif
  const int ty = CONTENTY + 96;
  const int x0 = (SCRW - (RACK_N * tw + (RACK_N - 1) * gap)) / 2;
  BoardPal P = theme.board();

  auto drawTile = [&](int i) {
    uint8_t t = g_game.player(g_game.current()).rack[i];
    int x = x0 + i * (tw + gap);
    tft->fillRect(x, ty, tw, tw, COL_BG);
    if (t == TILE_EMPTY) { tft->drawRoundRect(x, ty, tw, tw, 4, theme.edge()); return; }
    uint16_t face = sel[i] ? P.tile_last : P.tile;
    tft->fillRoundRect(x, ty, tw, tw, 4, face);
    tft->drawRoundRect(x, ty, tw, tw, 4, sel[i] ? COL_SEL : P.tile_edge);
    tft->setTextColor(P.tile_text, face);
    tft->setTextDatum(MC_DATUM);
    drawStr(t == TILE_BLANK ? String("?") : tileGlyph(t), x + tw / 2, ty + tw / 2, 4);
    if (t != TILE_BLANK) {
      tft->setTextDatum(BR_DATUM);
      tft->setTextColor(P.tile_val, face);
      drawStr(String((int)g_game.letterValue(t)), x + tw - 3, ty + tw - 2, 1);
    }
    tft->setTextDatum(TL_DATUM);
  };
  auto anySel = [&]() {
    for (int i = 0; i < RACK_N; i++) if (sel[i]) return true;
    return false;
  };

  // Static part, painted once.
  tft->fillScreen(COL_BG);
  drawHeader("Swap/Skip", true);
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("Choose the tiles you want to change.", SCRW / 2, CONTENTY + 26, G_UIFONT);
  drawStr("Select no tiles to just skip your turn.", SCRW / 2, CONTENTY + 48, G_UIFONT);
  if (g_game.bagCount() < RACK_N) {
    tft->setTextColor(TFT_RED, COL_BG);
    drawStr("Too few tiles in the bag to swap.", SCRW / 2, ty + tw + 22, G_UIFONT);
  }
  tft->setTextDatum(TL_DATUM);
  for (int i = 0; i < RACK_N; i++) drawTile(i);

  bool lastAny = false;
  drawNav("Select all", "", "Skip");

  for (;;) {
    uint16_t x, y;
    if (!waitTap(x, y)) continue;
    if (backTapped(x, y)) return false;

    if ((int)y >= ty && (int)y < ty + tw) {
      int i = ((int)x - x0) / (tw + gap);
      if (i >= 0 && i < RACK_N &&
          g_game.player(g_game.current()).rack[i] != TILE_EMPTY) {
        sel[i] = !sel[i];
        drawTile(i);                                  // just this tile
        if (anySel() != lastAny) {                    // and the footer label
          lastAny = anySel();
          drawNav("Select all", "", lastAny ? "Swap" : "Skip");
        }
      }
      continue;
    }

    int nh = navHit(x, y);
    if (nh == 0) {                                    // Select all
      for (int i = 0; i < RACK_N; i++) {
        bool want = (g_game.player(g_game.current()).rack[i] != TILE_EMPTY);
        if (sel[i] != want) { sel[i] = want; drawTile(i); }
      }
      if (anySel() != lastAny) {
        lastAny = anySel();
        drawNav("Select all", "", lastAny ? "Swap" : "Skip");
      }
      continue;
    }
    if (nh == 2) {
      if (!lastAny) { g_game.pass(); return true; }   // no tiles picked = skip
      if (g_game.exchange(sel)) return true;
      msgScreen("Swap", "Cannot swap",
                "The bag needs at least 7 tiles left.", TFT_RED);
      return false;
    }
  }
}

// Master: what the current rack could play, best first. Uses the generator's own
// ranked list and shows it as a scrolling list with each word's score — the
// previous version drew three words centred at font 4, which ran off the edges
// on anything long.
static bool masterScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("Master", true);
  tft->setTextColor(COL_DIM, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr("Searching...", SCRW / 2, SCRH / 2, 2);
  tft->setTextDatum(TL_DATUM);

  // Anything laid out is recalled first: the generator needs a clean board, and
  // a chosen suggestion is going to replace it anyway.
  g_game.clearPending();

