H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
  // Suggestions come from the everyday word list, not the full one: a hint of
  // ZYMURGY is useless. Validation still accepts anything in the full list, so
  // this only narrows what is SUGGESTED.
  static CpuMove mv[12];
  uint8_t n = cpuFindMoves(g_game, cpuDict(), mv, 12, 4000, &g_dawg);

  if (!n) {
    msgScreen("Master", "No moves found",
              "No legal word can be made from this rack on this board.", COL_DIM);
    return false;
  }

  // Turn each move into "WORD   score", skipping duplicates of the same word.
  // `src` maps a displayed row back to the move that produced it, so picking a
  // row can lay that exact move out on the board.
  static String rows[12];
  static uint8_t src[12];
  uint8_t nr = 0;
  for (uint8_t i = 0; i < n && nr < 12; i++) {
    String w;
    cpuApply(g_game, mv[i]);
    g_game.scorePending(&w);
    g_game.clearPending();
    String word = mainWord(w);
    bool dupe = false;
    for (uint8_t k = 0; k < nr; k++) if (rows[k].startsWith(word + " ")) dupe = true;
    if (dupe) continue;
    src[nr] = i;
    rows[nr++] = word + "   " + mv[i].score;
  }

  int sel = scrollList("Master", rows, nr, true);
  if (sel < 0 || sel >= nr) return false;

  // Lay the chosen suggestion out as pending tiles, exactly where it plays. The
  // move is already legal on this board -- it came from the generator -- so the
  // player only has to press Play, or Recall to take it back.
  cpuApply(g_game, mv[src[sel]]);
  return true;
}

// Words played — every turn of the game, per player, with what it scored.
// Opened by tapping the score line under the rack.
//
// Two columns when it is a two-player game. With three or four players there is
// no room for a column each, so it falls back to one chronological list with the
// player's name on each row.
static const int WP_ROWH = 30;

static void wordsPlayedScreen() {
  const uint8_t np = g_game.numPlayers();
  const bool two = (np == 2);
  const int CY = CONTENTY + 22;                     // below the column headings
  const int CH = SCRH - CY - 30;                    // above the totals line

  // Per-player move lists, in order of play.
  static uint8_t idx[MAX_PLAYERS][MAX_HISTORY];
  uint8_t cnt[MAX_PLAYERS] = { 0 };
  for (uint8_t i = 0; i < g_game.historyCount(); i++) {
    uint8_t p = g_game.history(i).player;
    if (p < MAX_PLAYERS && cnt[p] < MAX_HISTORY) idx[p][cnt[p]++] = i;
  }
  int rows = 0;
  if (two) { rows = max(cnt[0], cnt[1]); }
  else     { rows = g_game.historyCount(); }
  const int total = rows * WP_ROWH;

  TFT_eSprite spr(tft);
  spr.setColorDepth(16);
  bool haveSpr = (spr.createSprite(SCRW, CH) != nullptr);
  const uint8_t *sf = nullptr;

  // A move with no word was a pass; show it as such.
  auto cell = [&](TFT_eSprite &g, int x, int w, int y, uint8_t h) {
    const MoveRec &m = g_game.history(h);
    g.setTextDatum(ML_DATUM);
    g.setTextColor(m.score > 0 ? COL_OK : COL_DIM, COL_BG);
    sprStr(g, sf, String((int)m.score), x, y + WP_ROWH / 2, 2);
    g.setTextColor(COL_FG, COL_BG);
    sprStr(g, sf, m.word[0] ? String(m.word) : String("-"), x + 34, y + WP_ROWH / 2, 2);
  };

  float scroll = 0, fling = 0;
  auto render = [&]() {
    float maxS = total > CH ? total - CH : 0;
    if (scroll < 0) scroll = 0;
    if (scroll > maxS) scroll = maxS;
    if (!haveSpr) return;
    sf = nullptr;
    spr.fillSprite(COL_BG);
    for (int r = 0; r < rows; r++) {
      int y = r * WP_ROWH - (int)scroll;
      if (y + WP_ROWH < 0 || y > CH) continue;
      if (two) {
        if (r < cnt[0]) cell(spr, 10, SCRW / 2 - 14, y, idx[0][r]);
        if (r < cnt[1]) cell(spr, SCRW / 2 + 10, SCRW / 2 - 14, y, idx[1][r]);
        spr.drawFastVLine(SCRW / 2, y, WP_ROWH, theme.edge());
      } else {
        const MoveRec &m = g_game.history(r);
        spr.setTextDatum(ML_DATUM);
        spr.setTextColor(COL_DIM, COL_BG);
        sprStr(spr, sf, g_game.player(m.player).name, 10, y + WP_ROWH / 2, 2);
        cell(spr, 90, SCRW - 100, y, r);
      }
      spr.drawFastHLine(0, y + WP_ROWH - 1, SCRW, theme.edge());
    }
    sprScrollBar(spr, CH, total, scroll);
    spr.pushSprite(0, CY);
  };

  tft->fillScreen(COL_BG);
  drawHeader("Words played", true);

  // Column headings, and the running totals along the bottom.
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_FG, COL_BG);
  if (two) {
    drawStr(g_game.player(0).name, SCRW / 4, CONTENTY + 11, 2);
    drawStr(g_game.player(1).name, SCRW * 3 / 4, CONTENTY + 11, 2);
  } else {
    drawStr("All turns", SCRW / 2, CONTENTY + 11, 2);
  }
  {
    int y = SCRH - 15;
    tft->setTextColor(COL_OK, COL_BG);
    if (two) {
      drawStr(String(g_game.player(0).score) + " points", SCRW / 4, y, 2);
      drawStr(String(g_game.player(1).score) + " points", SCRW * 3 / 4, y, 2);
    } else {
      String s;
      for (uint8_t p = 0; p < np; p++)
        s += String(g_game.player(p).name) + " " + g_game.player(p).score + "  ";
      drawStr(s, SCRW / 2, y, 2);
    }
  }
  tft->setTextDatum(TL_DATUM);

  if (!rows) {
    tft->setTextDatum(MC_DATUM);
    tft->setTextColor(COL_DIM, COL_BG);
    drawStr("No turns played yet.", SCRW / 2, SCRH / 2, 2);
    tft->setTextDatum(TL_DATUM);
  }
  render();

  // Scroll / dismiss.
  bool wasDown = false, moved = false;
  uint16_t pX = 0, pY = 0, lastY = 0;
  float pScroll = 0, vel = 0;
  uint32_t lastT = 0;
  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t ty = touch->y(), tx = touch->x();
    uint32_t now = millis();

    if (down && !wasDown) {
      pX = tx; pY = ty; pScroll = scroll; moved = false; fling = 0;
      lastY = ty; lastT = now; vel = 0;
    } else if (down && wasDown) {
      int dy = (int)pY - (int)ty;
      if (abs(dy) > 6) moved = true;
      if (moved) {
        scroll = pScroll + dy;
        uint32_t dt = now - lastT;
        if (dt > 0) { vel = (float)((int)lastY - (int)ty) / (float)dt * 1000.0f; lastY = ty; lastT = now; }
        render();
      }
    } else if (!down && wasDown) {
      if (!moved) break;                    // any tap closes it
      fling = vel;
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      render();
    } else {
      fling = 0;
    }
    wasDown = down;
    delay(10);
  }
  if (haveSpr) spr.deleteSprite();
}

