H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
static const char *moveErrText(MoveErr e) {
  switch (e) {
    case MV_NO_TILES:      return "Place at least one tile first.";
    case MV_NOT_IN_LINE:   return "All tiles must be in one row or column.";
    case MV_HAS_GAP:       return "The word has a gap in it.";
    case MV_NOT_CENTRE:    return "The first word must cover the centre star.";
    case MV_NOT_CONNECTED: return "The word must touch a tile already played.";
    case MV_NO_WORD:       return "That makes no word at least two letters long.";
    case MV_TOO_MANY_CROSS: return "That touches too many words at once.";
    case MV_BAD_WORD:      return "Not in the word list:";
    default:               return "";
  }
}

// Definition viewer — reached by swiping along a word already on the board.
//
// Committed tiles only: a swipe that starts on one is a lookup, so panning still
// works by dragging from an empty square. The whole word under the swipe is read,
// not just the squares touched, so a quick flick across part of it is enough.
static void definitionScreen(const uint8_t *word, uint8_t len) {
  String w = wordDisplay(word, len);

  tft->fillScreen(COL_BG);
  drawHeader(w, true);
  tft->setTextDatum(MC_DATUM);
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("Looking up...", SCRW / 2, SCRH / 2, 2);
  tft->setTextDatum(TL_DATUM);

  String text;
  bool online = false;
  ledBusy();
  bool ok = defineWord(g_game.lang(), word, len,
                       WiFi.status() == WL_CONNECTED, text, online);
  ledOff();

  if (!ok) {
    msgScreen(w.c_str(), "No definition found",
              WiFi.status() == WL_CONNECTED
                ? "Not in the SD dictionary, and the online lookup had nothing."
                : "Not in the SD dictionary. Connect to WiFi to search online.",
              COL_DIM);
    return;
  }

  // Wrap into lines up front so the view can scroll without re-wrapping.
  static String line[64];
  uint8_t nline = 0;
  {
    String cur;
    int maxW = SCRW - 16;
    for (int i = 0; i <= (int)text.length() && nline < 64; i++) {
      char c = (i < (int)text.length()) ? text[i] : '\n';
      if (c == '\n') {
        if (cur.length()) line[nline++] = cur;
        cur = "";
        continue;
      }
      if (c == ' ' && !cur.length()) continue;
      String cand = cur + c;
      if (strWidth(cand, 2) > maxW) {
        int sp = cur.lastIndexOf(' ');
        if (sp > 0) {                        // break at the last space
          line[nline++] = cur.substring(0, sp);
          cur = cur.substring(sp + 1) + c;
        } else {
          line[nline++] = cur;
          cur = String(c);
        }
      } else {
        cur = cand;
      }
    }
    if (cur.length() && nline < 64) line[nline++] = cur;
  }

  const int LH = 20;
  const int CY = CONTENTY + 22;
  const int CH = SCRH - CY - NAVH;
  const int total = nline * LH;

  TFT_eSprite spr(tft);
  spr.setColorDepth(16);
  bool haveSpr = (spr.createSprite(SCRW, CH) != nullptr);
  const uint8_t *sf = nullptr;

  float scroll = 0, fling = 0;
  auto render = [&]() {
    float maxS = total > CH ? total - CH : 0;
    if (scroll < 0) scroll = 0;
    if (scroll > maxS) scroll = maxS;
    if (!haveSpr) return;
    sf = nullptr;
    spr.fillSprite(COL_BG);
    spr.setTextDatum(ML_DATUM);
    spr.setTextColor(COL_FG, COL_BG);
    for (uint8_t i = 0; i < nline; i++) {
      int y = i * LH - (int)scroll;
      if (y + LH < 0 || y > CH) continue;
      sprStr(spr, sf, line[i], 8, y + LH / 2, 2);
    }
    sprScrollBar(spr, CH, total, scroll);
    spr.pushSprite(0, CY);
  };

  tft->fillScreen(COL_BG);
  drawHeader(w, true);
  tft->setTextDatum(ML_DATUM);
  tft->setTextColor(online ? COL_OK : COL_DIM, COL_BG);
  drawStr(online ? "online" : "SD dictionary", 8, CONTENTY + 11, 1);
  tft->setTextDatum(TL_DATUM);
  drawNav("Back", "", WiFi.status() == WL_CONNECTED && !online ? "Online" : "");
  render();

  bool wasDown = false, moved = false;
  uint16_t pX = 0, pY = 0, lastY = 0;
  float pScroll = 0, vel = 0;
  uint32_t lastT = 0;
  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t ty = touch->y(), tx = touch->x();
    uint32_t now = millis();

    if (down && !wasDown) {
      pX = tx; pY = ty; pScroll = scroll; moved = false; fling = 0;
      lastY = ty; lastT = now; vel = 0;
    } else if (down && wasDown) {
      int dy = (int)pY - (int)ty;
      if (abs(dy) > 6) moved = true;
      if (moved) {
        scroll = pScroll + dy;
        uint32_t dt = now - lastT;
        if (dt > 0) { vel = (float)((int)lastY - (int)ty) / (float)dt * 1000.0f; lastY = ty; lastT = now; }
        render();
      }
    } else if (!down && wasDown) {
      if (!moved) {
        if (backTapped(pX, pY)) break;
        int nh = navHit(pX, pY);
        if (nh == 0) break;
        if (nh == 2 && WiFi.status() == WL_CONNECTED && !online) {
          if (haveSpr) spr.deleteSprite();
          String t2;
          ledBusy();
          bool got = defineOnline(g_game.lang(), word, len, t2);
          ledOff();
          if (got) { definitionScreen(word, len); return; }   // redraw with the new text
          msgScreen(w.c_str(), "Online lookup failed",
                    "No result, or the request timed out.", TFT_RED);
          return;
        }
      } else {
        fling = vel;
      }
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      render();
    } else {
      fling = 0;
    }
    wasDown = down;
    delay(10);
  }
  if (haveSpr) spr.deleteSprite();
}

// Read the whole committed word lying along `horiz` through (r,c). Returns its
// length, or 0 if there is no word of 2+ letters there.
static uint8_t wordAt(uint8_t r, uint8_t c, bool horiz, uint8_t *out) {
  int8_t dr = horiz ? 0 : 1, dc = horiz ? 1 : 0;
  int sr = r, sc = c;
  while (true) {                              // walk back to the start
    int pr = sr - dr, pc = sc - dc;
    if (pr < 0 || pc < 0 || pr >= BOARD_N || pc >= BOARD_N) break;
    if (g_game.isEmpty((uint8_t)pr, (uint8_t)pc)) break;
    sr = pr; sc = pc;
  }
  uint8_t n = 0;
  while (sr >= 0 && sc >= 0 && sr < BOARD_N && sc < BOARD_N && n < 15) {
    if (g_game.isEmpty((uint8_t)sr, (uint8_t)sc)) break;
    out[n++] = g_game.at((uint8_t)sr, (uint8_t)sc);
    sr += dr; sc += dc;
  }
  return n >= 2 ? n : 0;
}

