H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
// Polled by the move generator while it searches. Tapping the back box during a
// long think cancels the search so the screen can be left — otherwise the panel
// is unresponsive for the whole budget and a slow turn looks like a hang.
static bool cpuAbortOnBackTap() {
  touch->run();
  return touch->isPressed() && backTapped(touch->x(), touch->y());
}

static void gameOver() {
  g_game.applyFinalScores();
  uint8_t w = g_game.leader();
  // "You" needs "You win", not "You wins".
  String wn = g_game.player(w).name;
  msgScreen("Game over", wn + (wn == "You" ? " win" : " wins"),
            String("Final score ") + g_game.player(w).score, COL_OK);
  g_gameActive = false;
}

// Main interactive loop.
static void gameScreen() {
  g_selRack = -1;
  g_dragRack = -1;
  g_dragSlot = -1;
  g_dragFromBoard = false;
  g_banner = "";
  g_zoom = false; g_panX = g_panY = 0;
  // The board renders only through the sprites, so a failed allocation is fatal
  // to this screen rather than merely ugly. On 8 MB of PSRAM it should never
  // happen — say so plainly instead of showing a blank board.
  if (!gSpritesBegin()) {
    Serial.printf("[Game] sprite alloc failed (board=%s lower=%s) free PSRAM %u\n",
                  g_bs ? "ok" : "FAIL", g_ls ? "ok" : "FAIL",
                  (unsigned)ESP.getFreePsram());
    gSpritesEnd();
    msgScreen("Game", "Out of PSRAM",
              String("Could not allocate the board buffers. Free PSRAM: ") +
              (ESP.getFreePsram() / 1024) + " KB.", TFT_RED);
    return;
  }
  tft->fillScreen(COL_BG);
  gRenderAll();

  // Touch tracking: press point, whether it became a drag, and what it grabbed.
  bool wasDown = false, moved = false;
  int  pressX = 0, pressY = 0, panX0 = 0, panY0 = 0;
  bool panning = false;

  for (;;) {
    // CPU turn.
    if (g_game.player(g_game.current()).isCpu) {
      g_banner = "thinking...";
      g_bannerCol = COL_ACCENT;
      gRenderTop();

      CpuMove mv;
      uint8_t lvl = g_game.player(g_game.current()).cpuLevel;
      String who = g_game.player(g_game.current()).name;

      // The search blocks for seconds; without a hook the panel is frozen and a
      // slow turn is indistinguishable from a crash.
      cpuSetAbortHook(cpuAbortOnBackTap);
      bool found = cpuFindMove(g_game, cpuDict(), lvl, mv, 4000, &g_dawg);
      bool cancelled = cpuWasAborted();
      cpuSetAbortHook(nullptr);

      if (cancelled) {
        g_game.clearPending();          // opponent has not moved; leave as-is
        SD.mkdir(SAVE_DIR);
        g_game.save(SAVE_DIR "/auto.sav");
        gSpritesEnd();
        return;
      }

      bool played = false;
      if (found) {
        String w;
        cpuApply(g_game, mv);
        g_game.scorePending(&w);
        gRenderBoard();                      // show the tiles before committing
        delay(700);
        // commit() re-validates and can refuse. If it ever does, pass rather
        // than looping on the same search forever — that stall is what made the
        // opponent appear stuck "thinking".
        if (g_game.commit()) {
          played = true;
          g_zoom = false; g_panX = g_panY = 0;   // show the move that was made
          g_banner = who + " played " + mainWord(w) + " (+" + mv.score + ")";
          g_bannerCol = COL_SEL;
        } else {
          Serial.println(F("[CPU] commit refused its own move; passing"));
          g_game.clearPending();
        }
      }
      if (!played) {
        g_game.pass();                       // always makes progress
        g_banner = who + " skipped";
        g_bannerCol = COL_ACCENT;
      }

      if (g_game.isOver()) { gSpritesEnd(); gameOver(); return; }
      gRenderAll();
      continue;
    }

    touch->run();
    bool down = touch->isPressed();
    int x = touch->x(), y = touch->y();

    // ── press ────────────────────────────────────────────────────────────────
    if (down && !wasDown) {
      pressX = x; pressY = y; moved = false; panning = false;
      panX0 = g_panX; panY0 = g_panY;
      // A swipe beginning on a tile already played is a definition lookup, so
      // note that here and don't let it turn into a pan.
      {
        uint8_t rr, cc;
        g_swipeFrom = (gCellAt(x, y, rr, cc) && !g_game.isEmpty(rr, cc) &&
                       !g_game.isPendingAt(rr, cc));
        g_swipeR = rr; g_swipeC = cc;
      }

      // Grabbing a tile already laid out this turn lifts it back off the board
      // and onto the finger, so it can be moved somewhere else or returned to
      // the tray. Only THIS turn's tiles — committed ones are fixed.
      uint8_t pr, pc;
      if (gCellAt(x, y, pr, pc) && g_game.isPendingAt(pr, pc)) {
        int idx = -1;
        for (uint8_t k = 0; k < g_game.pendingCount(); k++)
          if (g_game.pending()[k].row == pr && g_game.pending()[k].col == pc)
            idx = g_game.pending()[k].rackIdx;
        if (idx >= 0) {
          g_game.unplaceAt(pr, pc);
          g_dragRack = idx; g_dragX = x; g_dragY = y;
          g_dragSlot = -1;                 // came from the board, not the tray
          g_dragFromBoard = true;
          gRenderBoard(); gRenderLower(); gRenderNav();
          wasDown = down;
          delay(8);
          continue;
        }
      }

      // Grabbing a rack tile starts a drag immediately.
      int ry = G_LSY + G_HINTH + 2;
      if (y >= ry && y < ry + G_RT) {
        for (int i = 0; i < RACK_N; i++) {
          if (x < rackSlotX(i) || x >= rackSlotX(i) + G_RT) continue;
          uint8_t t = g_game.player(g_game.current()).rack[i];
          bool onBoard = false;
          for (uint8_t k = 0; k < g_game.pendingCount(); k++)
            if (g_game.pending()[k].rackIdx == i) onBoard = true;
          if (t != TILE_EMPTY && !onBoard) {
            g_dragRack = i; g_dragX = x; g_dragY = y;
            g_dragSlot = raySlotAt(x, y);
            g_dragFromBoard = false;
          }
          break;
        }
      }
      wasDown = down;
      delay(8);
      continue;
    }

    // ── held ─────────────────────────────────────────────────────────────────
    if (down && wasDown) {
      if (abs(x - pressX) > 5 || abs(y - pressY) > 5) moved = true;
      if (g_dragRack >= 0) {
        g_dragX = x; g_dragY = y;
        g_dragSlot = raySlotAt(x, y);      // drives the tray gap preview
        gRenderBoard();
        gRenderLower();
      } else if (moved && g_swipeFrom) {
        // swiping a word: nothing to redraw while the finger travels
      } else if (moved && g_zoom && pressY >= G_BY && pressY < G_BY + G_BSZ) {
        // Drag on the board while zoomed pans the viewport.
        panning = true;
        g_panX = panX0 + (pressX - x);
        g_panY = panY0 + (pressY - y);
        gClampPan();
        gRenderBoard();
      }
      wasDown = down;
      delay(8);
      continue;
    }

