H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
    // ── release ──────────────────────────────────────────────────────────────
    if (!down && wasDown) {
      wasDown = down;

      // Finish a tile gesture. A TAP and a DRAG mean different things, and the
      // press handler cannot tell them apart, so it always starts a drag and the
      // distinction is made here:
      //
      //   tap a rack tile      -> select / deselect it (then tap a square to place)
      //   drag a rack tile     -> drop it on a square, or reorder the tray
      //   tap a placed tile    -> return it to the tray (it was lifted at press)
      //   drag a placed tile   -> move it somewhere else
      if (g_dragRack >= 0) {
        int  idx       = g_dragRack;
        int  slot      = g_dragSlot;
        bool fromBoard = g_dragFromBoard;
        g_dragRack = -1;
        g_dragSlot = -1;
        g_dragFromBoard = false;

        if (!moved) {
          // A tap. A lifted board tile simply stays in the tray; a rack tile
          // toggles selection for the tap-to-place route.
          g_selRack = fromBoard ? -1 : ((g_selRack == idx) ? -1 : idx);
        } else {
          uint8_t r, c;
          if (gCellAt(x, y - 10, r, c)) {
            if (gPlaceFrom(idx, r, c)) g_selRack = -1;
          } else if (slot >= 0) {
            g_game.moveRackTile((uint8_t)idx, (uint8_t)slot);
            g_selRack = -1;
          }
        }
        gRenderBoard();
        gRenderLower();
        gRenderNav();
        continue;
      }
      if (panning) { panning = false; continue; }

      // Finish a word swipe: take the word along whichever axis the finger
      // travelled furthest, reading the WHOLE word rather than just the squares
      // actually touched.
      if (moved && g_swipeFrom) {
        g_swipeFrom = false;
        uint8_t er, ec;
        if (gCellAt(x, y, er, ec)) {
          bool horiz = abs((int)ec - (int)g_swipeC) >= abs((int)er - (int)g_swipeR);
          uint8_t w[16];
          uint8_t n = wordAt(g_swipeR, g_swipeC, horiz, w);
          if (!n) n = wordAt(g_swipeR, g_swipeC, !horiz, w);   // try the other axis
          if (n) {
            definitionScreen(w, n);
            tft->fillScreen(COL_BG);
            gRenderAll();
          }
        }
        continue;
      }
      g_swipeFrom = false;
      if (moved) continue;                       // a swipe that grabbed nothing

      // Header back — snapshot to SD so Continue survives a power cycle.
      if (backTapped(x, y)) {
        SD.mkdir(SAVE_DIR);
        g_game.save(SAVE_DIR "/auto.sav");
        gSpritesEnd();
        return;
      }

      // Board tap: place / lift / zoom.
      uint8_t r, c;
      if (gCellAt(x, y, r, c)) {
        if (g_game.isPendingAt(r, c)) {          // lift a tile placed this turn
          g_game.unplaceAt(r, c);
          gRenderBoard(); gRenderLower(); gRenderNav();
        } else if (g_selRack >= 0 && g_game.isEmpty(r, c)) {
          if (gPlaceFrom(g_selRack, r, c)) g_selRack = -1;
          gRenderBoard(); gRenderLower(); gRenderNav();
        } else {
          // Nothing to place: tapping the board toggles zoom, centred here.
          g_zoom = !g_zoom;
          if (g_zoom) gCentreOn(r, c); else { g_panX = g_panY = 0; }
          gRenderBoard();
        }
        continue;
      }

      // Score line under the rack opens the Words-played history.
      {
        int sy = G_LSY + G_HINTH + 2 + G_RT + 2;
        if (y >= sy && y < sy + G_HINTH + 4) {
          wordsPlayedScreen();
          tft->fillScreen(COL_BG);
          gRenderAll();
          continue;
        }
      }

      // Rack tap (no drag): pick up / put down.
      int ry = G_LSY + G_HINTH + 2;
      if (y >= ry && y < ry + G_RT) {
        for (int i = 0; i < RACK_N; i++) {
          if (x >= rackSlotX(i) && x < rackSlotX(i) + G_RT) {
            g_selRack = (g_selRack == i) ? -1 : i;
            gRenderLower();
            break;
          }
        }
        continue;
      }

      // Footer.
      int nh = navHit(x, y);
      if (nh < 0) continue;
      bool placing = g_game.pendingCount() > 0;

      if (nh == 0) {                                   // Master
        bool placed = masterScreen();
        if (placed) { g_zoom = false; g_panX = g_panY = 0; }   // show where it went
        g_selRack = -1;
        tft->fillScreen(COL_BG);
        gRenderAll();
      } else if (placing && nh == 1) {                 // Recall
        g_game.clearPending();
        g_selRack = -1;
        g_zoom = false; g_panX = g_panY = 0;           // zoom out on recall
        gRenderBoard(); gRenderLower(); gRenderNav();
      } else if (placing && nh == 2) {                 // Play
        String bad;
        MoveErr e = g_game.validate(&bad);
        if (e != MV_OK) {
          msgScreen("Invalid move", moveErrText(e),
                    e == MV_BAD_WORD ? bad : String(""), TFT_RED);
          tft->fillScreen(COL_BG);
          gRenderAll();
        } else {
          String w;
          int pts = g_game.scorePending(&w);
          String who = g_game.player(g_game.current()).name;
          g_game.commit();
          g_selRack = -1;
          if (g_game.isOver()) { gSpritesEnd(); gameOver(); return; }
          g_zoom = false; g_panX = g_panY = 0;    // show the whole board again
          g_banner = who + " played " + mainWord(w) + " (+" + pts + ")";
          g_bannerCol = COL_SEL;
          gRenderAll();
        }
      } else if (!placing && nh == 1) {                 // Shuffle
        Player &p = g_game.player(g_game.current());
        for (int i = RACK_N - 1; i > 0; i--) {
          int j = random(i + 1);
          uint8_t t = p.rack[i]; p.rack[i] = p.rack[j]; p.rack[j] = t;
        }
        g_selRack = -1;
        gRenderLower();
      } else if (!placing && nh == 2) {                 // Swap / Skip
        if (swapSkipDialog()) {
          if (g_game.isOver()) { gSpritesEnd(); gameOver(); return; }
          g_banner = "";
        }
        g_selRack = -1;
        tft->fillScreen(COL_BG);
        gRenderAll();
      }
      continue;
    }

