H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
    wasDown = down;
    delay(8);
  }
}

// New-game setup: player count, then who is the CPU.
static void newGameFlow() {
  if (!g_dawg.loaded() && !dictLoad(true)) {
    msgScreen("New Game", "Word list not loaded",
              String(LANG_FILES[g_lang]) + " - " + g_dawg.error() +
              ". Copy the .dwg files to " SCRABBLE_DIR " on the SD card.", TFT_RED);
    return;
  }

  static String rows[3] = { "2 Players", "3 Players", "4 Players" };
  int n = scrollList("New Game", rows, 3, true);
  if (n < 0) return;
  uint8_t players = n + 2;

  static String orows[2] = { "All human (hotseat)", "Player 2 is the CPU" };
  int mode = scrollList("Opponent", orows, 2, true);
  if (mode < 0) return;

  uint8_t level = 1;
  if (mode == 1) {
    static String drows[3] = { "Easy", "Normal", "Hard" };
    int d = scrollList("Difficulty", drows, 3, true);
    if (d < 0) return;
    level = (uint8_t)d;
  }

  // Must precede begin(): that is what fills, spreads and deals the bag.
  g_game.setLuckHelper(g_luckHelper);
  g_game.begin(&g_dawg, g_lang, players);
  g_game.setCrossLimit(g_crossLimit);
  for (uint8_t p = 0; p < players; p++) {
    char nm[12];
    // Player 1 is whoever is holding the device.
    if (p == 0) strcpy(nm, "You");
    else        snprintf(nm, sizeof(nm), "P%u", (unsigned)(p + 1));
    g_game.setPlayer(p, nm, false);
  }
  if (mode == 1) g_game.setPlayer(1, "CPU", true, level);
  g_gameActive = true;

  gameScreen();
}

// Main menu (H4W9-style large rounded buttons)
static const char *MENU_ITEMS[] = { "New Game", "Continue", "Board Builder",
                                    "Dictionary Editor", "Settings" };
static const int    MENU_COUNT  = 5;
static const int    MENU_MARGIN = 16;
static const int    MENU_TOP    = CONTENTY + 12;
static const int    MENU_GAP    = 12;
static int menuBtnH() {
  int avail = SCRH - MENU_TOP - 12;
  return (avail - (MENU_COUNT - 1) * MENU_GAP) / MENU_COUNT;
}
static int menuBtnY(int i) { return MENU_TOP + i * (menuBtnH() + MENU_GAP); }
static int menuButtonAt(uint16_t x, uint16_t y) {
  if ((int)x < MENU_MARGIN || (int)x >= SCRW - MENU_MARGIN) return -1;
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int by = menuBtnY(i);
    if ((int)y >= by && (int)y < by + bh) return i;
  }
  return -1;
}

static void drawMenu() {
  tft->fillScreen(COL_BG);
  drawHeader(FW_NAME, false);
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int y = menuBtnY(i);
    tft->fillRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, COL_ACCENT);
    tft->drawRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, theme.neon(i * 3, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
#ifdef MARAUDER_V8
    drawStr(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 2);
#else
    // "Dictionary Editor" is wider than a button at font 4; drop a size rather
    // than let it run under the rounded corners.
    int f = (strWidth(MENU_ITEMS[i], 4) <= SCRW - 2 * MENU_MARGIN - 16) ? 4 : 2;
    drawStr(MENU_ITEMS[i], SCRW / 2, y + bh / 2, f);
#endif
  }
  tft->setTextDatum(TL_DATUM);
}

static void openMenuItem(int i) {
  switch (i) {
    case 0: newGameFlow(); break;
    case 1: {                                   // Continue
      if (g_gameActive) { gameScreen(); break; }
      // Nothing in memory — try the snapshot written when the board was left.
      if (!g_dawg.loaded() && !dictLoad(true)) {
        msgScreen("Continue", "Word list not loaded", g_dawg.error(), TFT_RED);
        break;
      }
      if (g_game.load(SAVE_DIR "/auto.sav", &g_dawg)) {
        g_game.setCrossLimit(g_crossLimit);
        g_game.setLuckHelper(g_luckHelper);
        // A save from the other language would be scored against the wrong bag.
        if (g_game.lang() != g_lang) {
          msgScreen("Continue", "Saved game is in the other language",
                    String("Switch Language back to ") +
                    LANG_NAMES[g_game.lang()] + " in Settings to resume it.", TFT_RED);
          break;
        }
        g_gameActive = true;
        gameScreen();
      } else {
        msgScreen("Continue", "No saved game",
                  "Start a new game. It is saved automatically when you leave "
                  "the board.", COL_DIM);
      }
      break;
    }
    case 2: boardBuilderScreen(); break;
    case 3: dictionaryScreen();   break;
    case 4: settingsFlow();       break;
    default: break;
  }
  drawMenu();
}

static bool mainMenuStart(ViewManager *viewManager) {
  drawMenu();
  return true;
}

static void mainMenuRun(ViewManager *viewManager) {
  static bool wasDown = false;
  TouchInput *t = viewManager->getInputManager()->getTouch();
  bool down = t->isPressed();
  if (down && !wasDown) {                              // fresh tap (press edge)
    uint16_t x = t->x(), y = t->y();
    int btn = menuButtonAt(x, y);
    if (btn >= 0) openMenuItem(btn);
  }
  wasDown = down;

  // Idle refresh of ONLY the header status corner + memory readout. The menu
  // buttons don't depend on either, so never repaint the whole screen here —
  // doing so made the menu flash repeatedly while a background connect cycled.
  static uint32_t lastRefresh = 0;
  static int lastStatus = -2;
  static bool lastConn = false;
  if (WiFi.status() != lastStatus || g_wifiConnecting != lastConn || millis() - lastRefresh > 4000) {
    lastRefresh = millis();
    lastStatus  = WiFi.status();
    lastConn    = g_wifiConnecting;
    drawHeaderStatus();
    drawHeaderMem(false);
  }
}

static const PROGMEM View mainMenuView = View("MainMenu", mainMenuRun, mainMenuStart, nullptr);

// Arduino entry points
void setup() {
  randomSeed(esp_random());
#ifndef DEVELOPER
  esp_log_level_set("*", ESP_LOG_NONE);
#endif

  Serial.begin(115200);
  uint32_t t0 = millis();
  while (!Serial && (millis() - t0) < 1500) delay(10);
  Serial.println(F("[" BOARD_NAME "] Scrabble starting..."));

  // Backlight off during init (PWM).
  pinMode(TFT_BL, OUTPUT);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(TFT_BL, 5000, 8);
  ledcWrite(TFT_BL, 0);
#else
  ledcSetup(0, 5000, 8);
  ledcAttachPin(TFT_BL, 0);
  ledcWrite(0, 0);
#endif

  // SD (shared FSPI bus on ESP32-C5) — must be up before ViewManager (Storage).
#ifdef HAS_C5_SD
  sharedSPI.begin(SD_SCK, SD_MISO, SD_MOSI);
  delay(100);
  if (!SD.begin(SD_CS, sharedSPI)) Serial.println(F("[" BOARD_NAME "] SD init failed"));
  else Serial.println(F("[" BOARD_NAME "] SD OK"));
#else
  if (!SD.begin(SD_CS)) Serial.println(F("[" BOARD_NAME "] SD init failed"));
#endif

  // SPIFFS for settings (format on first boot).
  if (!SPIFFS.begin(true)) Serial.println(F("[" BOARD_NAME "] SPIFFS mount failed"));
  else                     Serial.println(F("[" BOARD_NAME "] SPIFFS OK"));

#ifdef HAS_PSRAM
  // The word lists are ~2 MB and live in PSRAM. Without it the Dictionary screen
  // reports "out of memory" — check Tools -> PSRAM -> Enabled.
  if (!psramInit()) Serial.println(F("[" BOARD_NAME "] PSRAM unavailable"));
#endif

#ifdef HAS_CAP_TOUCH
  // Capacitive touch (also does Wire.begin on the shared I2C bus).
  ft6336_init();
#else
  // V8 has no I2C touch controller (XPT2046 rides the SPI bus), but the fuel
  // gauge below still needs the I2C bus that ft6336_init() would have opened.
  Wire.begin(I2C_SDA, I2C_SCL, 400000U);
#endif
  battInit();                          // MAX17048 fuel gauge on the same I2C bus

  // Load persisted settings before anything draws.
  theme.load();
  cfgLoad();
  // Both of these read the SD card, so they belong after it is mounted and
  // after cfgLoad() has said which board to use.
  gridBegin(g_gridName);   // premium-square layout (Board Builder)
  weBegin();               // Dictionary Editor overrides
  g_dist.begin();          // editable letter distribution (Settings -> Letters)

