H4W9/ESP32_Scrabble/ESP32_Scrabble.ino
  // Put the status LED in a known-off state (also arms the V8's PWM channel).
  ledOff();

  // ViewManager owns the panel (Draw) and touch (InputManager).
#ifdef MARAUDER_V8
  vm    = new ViewManager(MarauderV8Config);
#else
  vm    = new ViewManager(PancakeConfig);
#endif
  tft   = vm->getDraw()->display->getTFT();
  touch = vm->getInputManager()->getTouch();
  applyThemeToViewManager();

  // Backlight on at the saved brightness.
  applyBrightness();

#ifndef HAS_CAP_TOUCH
  // Resistive panel: point TouchInput at TFT_eSPI's XPT2046 reader, then load
  // the stored calibration (or run the wizard). Must come after the backlight is
  // up, or a first-boot user would be tapping an unlit screen.
  if (touch) touch->attachTFT(tft);
  touchCalInit();
#endif

  // WiFi: capture disconnect reasons for diagnostics.
  WiFi.onEvent(wifiEvent);
  WiFi.mode(WIFI_STA);

  // Show the main menu immediately, then connect to saved WiFi in the background
  // (header icon + LED report progress). The word list is NOT loaded here — it is
  // a ~2 MB SD read, and making the menu wait on it would be a poor first impression.
  vm->add(&mainMenuView);
  vm->set("MainMenu");
  wifiBgBegin();
  drawHeaderStatus();                  // show the "connecting" (yellow) icon at once

  Serial.println(F("[" BOARD_NAME "] Ready."));
}

void loop() {
  vm->run();
  wifiBgTick();                        // advance the background WiFi connect

  // Reconnect watchdog: ONLY on the drop edge (connected -> lost), make one
  // reconnect pass (the two closest saved nets). If it fails we stay disconnected
  // rather than retrying forever — the LED goes off instead of pulsing amber.
  static bool wasConnected = false;
  bool nowConnected = (WiFi.status() == WL_CONNECTED);
  if (wasConnected && !nowConnected && !g_manualDisconnect && (g_wb == WB_DONE || g_wb == WB_IDLE)) {
    wifiBgBegin();
  }
  wasConnected = nowConnected;

  // Activity LED mirrors the connecting state (on while scanning/associating).
  static bool ledState = false;
  if (g_wifiConnecting != ledState) { ledState = g_wifiConnecting; ledSet(ledState); }

  delay(5);
}
